using System.Runtime.CompilerServices;

namespace ServerCore.数据处理;

public static class 万能类型扩展包
{
	
	public static void 取数据(this 属性缓存数据类 属性总值, 人物属性数据类 属性数据, 属性缓存数据类 附加数据)
	{
		属性总值.当前气血 = 属性数据.当前气血 + 附加数据.当前气血;
		属性总值.最大气血 = 属性数据.最大气血 + 附加数据.最大气血;
		属性总值.当前法力 = 属性数据.当前法力 + 附加数据.当前法力;
		属性总值.最大法力 = 属性数据.最大法力 + 附加数据.最大法力;
		属性总值.物理伤害 = 属性数据.当前物攻 + 附加数据.物理伤害;
		属性总值.法术伤害 = 属性数据.当前法攻 + 附加数据.法术伤害;
		属性总值.防御 = 属性数据.当前防御 + 附加数据.防御;
		属性总值.速度 = 属性数据.当前速度 + 附加数据.速度;
		属性总值.准确 = 属性数据.准确 + 附加数据.准确;
		属性总值.躲闪率 = 附加数据.躲闪率;
		属性总值.金抗性 = 属性数据.金抗性 + 附加数据.金抗性;
		属性总值.木抗性 = 属性数据.木抗性 + 附加数据.木抗性;
		属性总值.水抗性 = 属性数据.水抗性 + 附加数据.水抗性;
		属性总值.火抗性 = 属性数据.火抗性 + 附加数据.火抗性;
		属性总值.土抗性 = 属性数据.土抗性 + 附加数据.土抗性;
		属性总值.抗中毒 = 附加数据.抗中毒;
		属性总值.抗冰冻 = 附加数据.抗冰冻;
		属性总值.抗昏睡 = 附加数据.抗昏睡;
		属性总值.抗遗忘 = 附加数据.抗遗忘;
		属性总值.抗混乱 = 附加数据.抗混乱;
		属性总值.连击率 = 属性数据.连击率 + 附加数据.连击率;
		属性总值.连击 = 属性数据.连击数 + 附加数据.连击;
		属性总值.反击率 = 属性数据.反击率 + 附加数据.反击率;
		属性总值.反击 = 属性数据.反击数 + 附加数据.反击;
		属性总值.物理必杀率 = 属性数据.必杀率 + 附加数据.物理必杀率;
		属性总值.反震度 = 属性数据.反震度 + 附加数据.反震度;
		属性总值.反震率 = 属性数据.反震率 + 附加数据.反震率;
		属性总值.破防 = 属性数据.破防 + 附加数据.破防;
		属性总值.破防率 = 附加数据.破防率;
		属性总值.忽视目标抗金 = 附加数据.忽视目标抗金;
		属性总值.忽视目标抗木 = 附加数据.忽视目标抗木;
		属性总值.忽视目标抗水 = 附加数据.忽视目标抗水;
		属性总值.忽视目标抗火 = 附加数据.忽视目标抗火;
		属性总值.忽视目标抗土 = 附加数据.忽视目标抗土;
		属性总值.忽视目标抗遗忘 = 附加数据.忽视目标抗遗忘;
		属性总值.忽视目标抗中毒 = 附加数据.忽视目标抗中毒;
		属性总值.忽视目标抗冰冻 = 附加数据.忽视目标抗冰冻;
		属性总值.忽视目标抗昏睡 = 附加数据.忽视目标抗昏睡;
		属性总值.忽视目标抗混乱 = 附加数据.忽视目标抗混乱;
		属性总值.强力克金 = 附加数据.强力克金;
		属性总值.强力克木 = 附加数据.强力克木;
		属性总值.强力克水 = 附加数据.强力克水;
		属性总值.强力克火 = 附加数据.强力克火;
		属性总值.强力克土 = 附加数据.强力克土;
		属性总值.师门攻击技能消耗降低 = 附加数据.师门攻击技能消耗降低;
		属性总值.师门障碍技能消耗降低 = 附加数据.师门障碍技能消耗降低;
		属性总值.师门辅助技能消耗降低 = 附加数据.师门辅助技能消耗降低;
		属性总值.强力中毒 = 附加数据.强力中毒;
		属性总值.强力昏睡 = 附加数据.强力昏睡;
		属性总值.强力遗忘 = 附加数据.强力遗忘;
		属性总值.强力混乱 = 附加数据.强力混乱;
		属性总值.强力冰冻 = 附加数据.强力冰冻;
		属性总值.强金法伤害 = 附加数据.强金法伤害;
		属性总值.强木法伤害 = 附加数据.强木法伤害;
		属性总值.强水法伤害 = 附加数据.强水法伤害;
		属性总值.强火法伤害 = 附加数据.强火法伤害;
		属性总值.强土法伤害 = 附加数据.强土法伤害;
		属性总值.躲避攻击 = 附加数据.躲避攻击;
		属性总值.金光乍现反击率 = 附加数据.金光乍现反击率;
		属性总值.摘叶飞花反击率 = 附加数据.摘叶飞花反击率;
		属性总值.滴水穿石反击率 = 附加数据.滴水穿石反击率;
		属性总值.举火焚天反击率 = 附加数据.举火焚天反击率;
		属性总值.落土飞岩反击率 = 附加数据.落土飞岩反击率;
		属性总值.解除遗忘状态 = 附加数据.解除遗忘状态;
		属性总值.解除中毒状态 = 附加数据.解除中毒状态;
		属性总值.解除冰冻状态 = 附加数据.解除冰冻状态;
		属性总值.解除昏睡状态 = 附加数据.解除昏睡状态;
		属性总值.解除混乱状态 = 附加数据.解除混乱状态;
		属性总值.所有技能上升 = 附加数据.所有技能上升;
		属性总值.攻击效果 = 属性数据.攻击效果 + 附加数据.攻击效果;
		属性总值.抗物理 = 属性数据.抗物理 + 附加数据.抗物理;
		属性总值.抗法术 = 属性数据.抗法术 + 附加数据.抗法术;
		属性总值.忽视目标连击 = 附加数据.忽视目标连击;
		属性总值.忽视目标物理必杀 = 附加数据.忽视目标物理必杀;
		属性总值.追击率 = 附加数据.追击率;
		属性总值.强力障碍宠物 = 附加数据.强力障碍宠物;
		属性总值.忽视躲避攻击 = 附加数据.忽视躲避攻击;
		属性总值.强物理伤害 = 附加数据.强物理伤害;
		属性总值.法术必杀率 = 附加数据.法术必杀率;
		属性总值.忽视目标法术必杀 = 附加数据.忽视目标法术必杀;
		属性总值.抗神圣之光 = 附加数据.抗神圣之光;
		属性总值.抗游说之舌 = 附加数据.抗游说之舌;
		属性总值.抗舍命一击 = 附加数据.抗舍命一击;
		属性总值.抗翻转乾坤 = 附加数据.抗翻转乾坤;
		属性总值.抗漫天血舞 = 附加数据.抗漫天血舞;
		属性总值.忽视目标抗物理 = 附加数据.忽视目标抗物理;
		属性总值.闪避 = 属性数据.闪避 + 附加数据.闪避;
		属性总值.抗镇魂 = 附加数据.抗镇魂;
		属性总值.抗化功 = 附加数据.抗化功;
		属性总值.抗水牢 = 附加数据.抗水牢;
		属性总值.抗锁灵 = 附加数据.抗锁灵;
		属性总值.抗迷心 = 附加数据.抗迷心;
		属性总值.忽视目标抗镇魂 = 附加数据.忽视目标抗镇魂;
		属性总值.忽视目标抗化功 = 附加数据.忽视目标抗化功;
		属性总值.忽视目标抗水牢 = 附加数据.忽视目标抗水牢;
		属性总值.忽视目标抗锁灵 = 附加数据.忽视目标抗锁灵;
		属性总值.忽视目标抗迷心 = 附加数据.忽视目标抗迷心;
		属性总值.解除镇魂状态 = 附加数据.解除镇魂状态;
		属性总值.解除化功状态 = 附加数据.解除化功状态;
		属性总值.解除水牢状态 = 附加数据.解除水牢状态;
		属性总值.解除锁灵状态 = 附加数据.解除锁灵状态;
		属性总值.解除迷心状态 = 附加数据.解除迷心状态;
		属性总值.强力镇魂 = 附加数据.强力镇魂;
		属性总值.强力化功 = 附加数据.强力化功;
		属性总值.强力水牢 = 附加数据.强力水牢;
		属性总值.强力锁灵 = 附加数据.强力锁灵;
		属性总值.强力迷心 = 附加数据.强力迷心;
		属性总值.出其不意 = 附加数据.出其不意;
		属性总值.无法无天 = 附加数据.无法无天;
		属性总值.辅助之力 = 附加数据.辅助之力;
		属性总值.重生 = 附加数据.重生;
	}

	static 万能类型扩展包()
	{
	}
}
