using System.Runtime.CompilerServices;

public class 六道轮回存档数据类
{
	public AllEnums.轮回Type 转世状态;

	public AllEnums.六道Type 转世阶段;

	public int 已刷新次数;

	public 轮回转世属性存档[] 转世属性列表;

	
	public void 清空()
	{
		转世状态 = AllEnums.轮回Type.未开始;
		转世阶段 = AllEnums.六道Type.地狱道;
		已刷新次数 = 0;
		转世属性列表[0].转世属性 = 0;
		转世属性列表[0].属性数值 = 0;
		转世属性列表[1].转世属性 = 0;
		转世属性列表[1].属性数值 = 0;
		转世属性列表[2].转世属性 = 0;
		转世属性列表[2].属性数值 = 0;
		转世属性列表[3].转世属性 = 0;
		转世属性列表[3].属性数值 = 0;
		转世属性列表[4].转世属性 = 0;
		转世属性列表[4].属性数值 = 0;
		转世属性列表[5].转世属性 = 0;
		转世属性列表[5].属性数值 = 0;
	}

	
	public 六道轮回存档数据类()
	{
		转世属性列表 = new 轮回转世属性存档[6];
	}

	static 六道轮回存档数据类()
	{
	}
}
