using System;
using System.Collections.Concurrent;
using System.Collections.Generic;

public static class 问道数据类
{
	public static ConcurrentDictionary<string, 装备数据表> equip = new ConcurrentDictionary<string, 装备数据表>();

	public static ConcurrentDictionary<string, 装备数据表> 妖族转门派武器字典 = new ConcurrentDictionary<string, 装备数据表>();

	public static ConcurrentDictionary<string, string> 装备性别对应字典 = new ConcurrentDictionary<string, string>();

	public static ConcurrentDictionary<string, 角色Info类> userInfo = new ConcurrentDictionary<string, 角色Info类>();

	public static ConcurrentDictionary<string, 角色技能类> userSkill = new ConcurrentDictionary<string, 角色技能类>();

	public static List<技能详细数据类> 技能详细数据 = new List<技能详细数据类>();

	public static ConcurrentDictionary<string, string> 出生地图列表 = new ConcurrentDictionary<string, string>();

	public static List<int> GM权限请求包头组 = new List<int>();

	public static ConcurrentDictionary<string, AllEnums.宠物Type> 宠物分类字典 = new ConcurrentDictionary<string, AllEnums.宠物Type>();

	public static ConcurrentDictionary<int, int> 怀旧技能字典 = new ConcurrentDictionary<int, int>();

	public static ConcurrentDictionary<string, int> 所有技能ID = new ConcurrentDictionary<string, int>();

	public static ConcurrentDictionary<int, List<int>> 所有等级首饰转属次数 = new ConcurrentDictionary<int, List<int>>();

	public static ConcurrentDictionary<string, bool> 所有坐姿对应动作 = new ConcurrentDictionary<string, bool>();

	public static readonly HashSet<int> 特效类型字典 = new HashSet<int>((int[])Enum.GetValues(typeof(AllEnums.特效类型Type)));

	public static readonly HashSet<int> 属性名字字典 = new HashSet<int>((int[])Enum.GetValues(typeof(AllEnums.属性名字Type)));

	public static ConcurrentDictionary<string, string> 预处理包头 = new ConcurrentDictionary<string, string>();

	public static ConcurrentDictionary<string, int> 前缀字典 = new ConcurrentDictionary<string, int>();

	public static ConcurrentDictionary<string, string> 属性字典 = new ConcurrentDictionary<string, string>();

	public static List<string> 删除任务列表 = new List<string>();

	public static void Init()
	{
		删除任务列表.Clear();
		删除任务列表.Add("全民升级");
		删除任务列表.Add("速赛竞技场");
		删除任务列表.Add("【跨服玩法】登上九重天");
		删除任务列表.Add("学习新的法术");
		userInfo.TryAdd("111", new 角色Info类(AllEnums.五行Type.金, AllEnums.门派Type.五龙山云霄洞, AllEnums.性别Type.男, AllEnums.新旧Type.旧, "6001"));
		userInfo.TryAdd("112", new 角色Info类(AllEnums.五行Type.金, AllEnums.门派Type.五龙山云霄洞, AllEnums.性别Type.女, AllEnums.新旧Type.旧, "7001"));
		userInfo.TryAdd("121", new 角色Info类(AllEnums.五行Type.金, AllEnums.门派Type.五龙山云霄洞, AllEnums.性别Type.男, AllEnums.新旧Type.新, "4001"));
		userInfo.TryAdd("122", new 角色Info类(AllEnums.五行Type.金, AllEnums.门派Type.五龙山云霄洞, AllEnums.性别Type.女, AllEnums.新旧Type.新, "5001"));
		userInfo.TryAdd("211", new 角色Info类(AllEnums.五行Type.木, AllEnums.门派Type.终南山玉柱洞, AllEnums.性别Type.男, AllEnums.新旧Type.旧, "7002"));
		userInfo.TryAdd("212", new 角色Info类(AllEnums.五行Type.木, AllEnums.门派Type.终南山玉柱洞, AllEnums.性别Type.女, AllEnums.新旧Type.旧, "6002"));
		userInfo.TryAdd("221", new 角色Info类(AllEnums.五行Type.木, AllEnums.门派Type.终南山玉柱洞, AllEnums.性别Type.男, AllEnums.新旧Type.新, "4002"));
		userInfo.TryAdd("222", new 角色Info类(AllEnums.五行Type.木, AllEnums.门派Type.终南山玉柱洞, AllEnums.性别Type.女, AllEnums.新旧Type.新, "5002"));
		userInfo.TryAdd("311", new 角色Info类(AllEnums.五行Type.水, AllEnums.门派Type.凤凰山斗阙宫, AllEnums.性别Type.男, AllEnums.新旧Type.旧, "7003"));
		userInfo.TryAdd("312", new 角色Info类(AllEnums.五行Type.水, AllEnums.门派Type.凤凰山斗阙宫, AllEnums.性别Type.女, AllEnums.新旧Type.旧, "6003"));
		userInfo.TryAdd("321", new 角色Info类(AllEnums.五行Type.水, AllEnums.门派Type.凤凰山斗阙宫, AllEnums.性别Type.男, AllEnums.新旧Type.新, "4003"));
		userInfo.TryAdd("322", new 角色Info类(AllEnums.五行Type.水, AllEnums.门派Type.凤凰山斗阙宫, AllEnums.性别Type.女, AllEnums.新旧Type.新, "5003"));
		userInfo.TryAdd("411", new 角色Info类(AllEnums.五行Type.火, AllEnums.门派Type.乾元山金光洞, AllEnums.性别Type.男, AllEnums.新旧Type.旧, "6004"));
		userInfo.TryAdd("412", new 角色Info类(AllEnums.五行Type.火, AllEnums.门派Type.乾元山金光洞, AllEnums.性别Type.女, AllEnums.新旧Type.旧, "7004"));
		userInfo.TryAdd("421", new 角色Info类(AllEnums.五行Type.火, AllEnums.门派Type.乾元山金光洞, AllEnums.性别Type.男, AllEnums.新旧Type.新, "4004"));
		userInfo.TryAdd("422", new 角色Info类(AllEnums.五行Type.火, AllEnums.门派Type.乾元山金光洞, AllEnums.性别Type.女, AllEnums.新旧Type.新, "5004"));
		userInfo.TryAdd("511", new 角色Info类(AllEnums.五行Type.土, AllEnums.门派Type.骷髅山白骨洞, AllEnums.性别Type.男, AllEnums.新旧Type.旧, "6005"));
		userInfo.TryAdd("512", new 角色Info类(AllEnums.五行Type.土, AllEnums.门派Type.骷髅山白骨洞, AllEnums.性别Type.女, AllEnums.新旧Type.旧, "7005"));
		userInfo.TryAdd("521", new 角色Info类(AllEnums.五行Type.土, AllEnums.门派Type.骷髅山白骨洞, AllEnums.性别Type.男, AllEnums.新旧Type.新, "4005"));
		userInfo.TryAdd("522", new 角色Info类(AllEnums.五行Type.土, AllEnums.门派Type.骷髅山白骨洞, AllEnums.性别Type.女, AllEnums.新旧Type.新, "5005"));
		userSkill.TryAdd("11", new 角色技能类("jindun-shu", "jinguang-zhaxian", "daoguang-jianying", "jinhong-guanri", "liuguang-yicai", "nitian-canren", "liulian-wangfan", "deyi-wangxing", "ruchi-ruzui", "rumeng-chuxing", "huangruo-geshi", "tiansheng-shenli", "qichong-douniu", "jiuniu-erhu", "ruhu-tianyi", "liwan-kuanglan", "jinbi-huihuang", "zhidao-huanglong", "jincheng-tangchi", "jinfa-fenghun"));
		userSkill.TryAdd("12", new 角色技能类("jindun-shu", "dandao-zhiru", "ruibu-kedang", "qiandao-wanren", "fengmang-bilou", "wandao-jinguang", "buzhi-suocuo", "danzhan-xinjing", "jinghun-weiding", "zhenhun-suoxin", "duoshen-shepo", "quanli-yifu", "qiguan-changhong", "jianba-nuzhang", "shiru-pozhu", "lipi-xuanhuang", "jinbi-huihuang", "zhidao-huanglong", "jincheng-tangchi", "jinfa-fenghun"));
		userSkill.TryAdd("21", new 角色技能类("mudun-shu", "zhaiye-feihua", "feiliu-xianshi", "pangen-cuojie", "luoying-binfen", "guiwu-kuteng", "jianxie-fenghou", "shekou-fengzhen", "heding-hongfen", "xiewei-shexian", "wanyi-shixin", "bamiao-zhuzhang", "huoshang-jiaoyou", "shuizhang-chuangao", "honghua-lvye", "jinshang-tianhua", "luoye-xiaoxiao", "manwu-feitian", "baidu-buqin", "judu-gongxin"));
		userSkill.TryAdd("22", new 角色技能类("mudun-shu", "huawu-yefei", "yanghua-feiliu", "qiufeng-saoye", "yiye-puti", "tiannv-sanhua", "mangci-zaibei", "wufu-chongsheng", "duru-gusui", "jiusi-yisheng", "zhetian-biri", "ganzhi-ruyi", "chunfeng-huayu", "runwu-wusheng", "tihu-guanding", "miaoshou-huichun", "luoye-xiaoxiao", "manwu-feitian", "baidu-buqin", "judu-gongxin"));
		userSkill.TryAdd("31", new 角色技能类("shuidun-shu", "dishui-chuanshi", "yuhen-yunchou", "xuanhe-xieshui", "nubo-kuangtao", "jiaohai-fanjiang", "sanjiu-yanhan", "tianhan-didong", "bingdong-sanchi", "jidi-binghan", "baoluo-wanxiang", "fangwei-dujian", "tiegu-zhengzheng", "binglai-jiangdang", "tongqiang-tiebi", "tiandi-hunyuan", "shuitian-yise", "tiema-binghe", "shuangjia-bingdun", "xuepiao-wanli"));
		userSkill.TryAdd("32", new 角色技能类("shuidun-shu", "shuiliu-huaxie", "jishui-chengyuan", "fengqi-shuiyong", "xueyao-bingtian", "jiaolong-deshui", "dishui-bulou", "shengou-bilei", "jixue-fengshuang", "riyue-hebi", "jinghua-shuiyue", "tugu-naxin", "fanghuan-weiran", "hunran-yiti", "yuxiao-yunsan", "shuihuo-buqin", "shuitian-yise", "tiema-binghe", "shuangjia-bingdun", "xuepiao-wanli"));
		userSkill.TryAdd("41", new 角色技能类("huodun-shu", "juhuo-fentian", "xinghuo-liaoyuan", "yantian-huoyu", "jiaojin-lishi", "lianyu-huohai", "xinzui-shenmi", "shenhun-diandao", "hunbu-shoushe", "hunqian-mengying", "hunbu-futi", "shiwan-huoji", "xiansheng-duoren", "jifeng-xunlei", "fengchi-dianche", "binggui-shensu", "huoshu-yinhua", "huifei-yanmie", "sanmei-lianxin", "lihuo-duopo"));
		userSkill.TryAdd("42", new 角色技能类("huodun-shu", "nujian-lixian", "yijian-shuangdiao", "jianbu-xufa", "xingfei-yunsan", "wanjian-chuanxin", "xinsuo-shenfeng", "chongyuan-diesuo", "rufeng-sibi", "kunling-suoxin", "yunmi-wusuo", "jiru-xinghuo", "xingchi-dianzou", "dianguang-shihuo", "feiyun-zhidian", "huxiao-fengchi", "huoshu-yinhua", "huifei-yanmie", "sanmei-lianxin", "lihuo-duopo"));
		userSkill.TryAdd("51", new 角色技能类("tudun-shu", "luotu-feiyan", "tumo-chenmai", "shanbeng-dilie", "tianta-dixian", "shipo-tianjing", "youxin-wuli", "guci-shibi", "liushen-wuzhu", "dishu-qipo", "tianding-sanhun", "bianchang-moji", "bishi-jiuxu", "huaxian-weiyi", "wangfeng-puying", "yixing-huanying", "feisha-zoushi", "kaibei-lieshi", "xinru-panshi", "diwo-nanfen"));
		userSkill.TryAdd("52", new 角色技能类("tudun-shu", "tubeng-wajie", "chentu-feiyang", "yangli-feisha", "didong-shanyao", "qianyan-wanhe", "jinghuang-shicuo", "ranshen-luanzhi", "shenhun-piaodang", "shenyao-yiduo", "jingshen-podan", "xuxu-shishi", "gunong-xuanxu", "konghuan-xushi", "xukong-huanying", "xuwu-piaomiao", "feisha-zoushi", "kaibei-lieshi", "xinru-panshi", "diwo-nanfen"));
		装备性别对应字典.TryAdd("方巾", "簪子");
		装备性别对应字典.TryAdd("皮帽", "飞凤钗");
		装备性别对应字典.TryAdd("青铜盔", "碧玉钗");
		装备性别对应字典.TryAdd("冲天盔", "蝴蝶钗");
		装备性别对应字典.TryAdd("虎头盔", "金钗");
		装备性别对应字典.TryAdd("神龙盔", "珍珠钗");
		装备性别对应字典.TryAdd("白玉冠", "凤尾钗");
		装备性别对应字典.TryAdd("乾坤冠", "鱼尾冠");
		装备性别对应字典.TryAdd("龙冠", "凤冠");
		装备性别对应字典.TryAdd("蟠龙冠", "金霞冠");
		装备性别对应字典.TryAdd("星耀冠", "凌波霞冠");
		装备性别对应字典.TryAdd("七星宝冠", "天灵宝冠");
		装备性别对应字典.TryAdd("白玉星冠", "九彩玲珠冠");
		装备性别对应字典.TryAdd("双翼灵枭冠", "赤鸾翎羽冠");
		装备性别对应字典.TryAdd("金翼龙冠", "菁麟宝冠");
		装备性别对应字典.TryAdd("太清玄冠", "玉清仙冠");
		装备性别对应字典.TryAdd("飘渺琼华冠", "云根沧霞冠");
		装备性别对应字典.TryAdd("上清逍遥冠", "太妙烟霞冠");
		装备性别对应字典.TryAdd("簪子", "方巾");
		装备性别对应字典.TryAdd("飞凤钗", "皮帽");
		装备性别对应字典.TryAdd("碧玉钗", "青铜盔");
		装备性别对应字典.TryAdd("蝴蝶钗", "冲天盔");
		装备性别对应字典.TryAdd("金钗", "虎头盔");
		装备性别对应字典.TryAdd("珍珠钗", "神龙盔");
		装备性别对应字典.TryAdd("凤尾钗", "白玉冠");
		装备性别对应字典.TryAdd("鱼尾冠", "乾坤冠");
		装备性别对应字典.TryAdd("凤冠", "龙冠");
		装备性别对应字典.TryAdd("金霞冠", "蟠龙冠");
		装备性别对应字典.TryAdd("凌波霞冠", "星耀冠");
		装备性别对应字典.TryAdd("天灵宝冠", "七星宝冠");
		装备性别对应字典.TryAdd("九彩玲珠冠", "白玉星冠");
		装备性别对应字典.TryAdd("赤鸾翎羽冠", "双翼灵枭冠");
		装备性别对应字典.TryAdd("菁麟宝冠", "金翼龙冠");
		装备性别对应字典.TryAdd("玉清仙冠", "太清玄冠");
		装备性别对应字典.TryAdd("云根沧霞冠", "飘渺琼华冠");
		装备性别对应字典.TryAdd("太妙烟霞冠", "上清逍遥冠");
		装备性别对应字典.TryAdd("布衣", "布裙");
		装备性别对应字典.TryAdd("虎皮衣", "绛紫裙");
		装备性别对应字典.TryAdd("青铜铠", "虹羽衣");
		装备性别对应字典.TryAdd("皂罗袍", "凤暖袍");
		装备性别对应字典.TryAdd("金锁甲", "锦月袄");
		装备性别对应字典.TryAdd("莽龙袍", "凝霜衣");
		装备性别对应字典.TryAdd("金丝甲", "水合袍");
		装备性别对应字典.TryAdd("八卦衣", "狐皮袄");
		装备性别对应字典.TryAdd("连环甲", "蛟皮袄");
		装备性别对应字典.TryAdd("金缕衣", "天蚕衣");
		装备性别对应字典.TryAdd("天衣", "霓裳羽衣");
		装备性别对应字典.TryAdd("瀚宇法袍", "星晶法衣");
		装备性别对应字典.TryAdd("诸天法袍", "神鸢凤裘");
		装备性别对应字典.TryAdd("天玄真神甲", "万霞霓罗裳");
		装备性别对应字典.TryAdd("赤金磐龙甲", "玄女绛绡衣");
		装备性别对应字典.TryAdd("紫金神风甲", "凤翼轻裘");
		装备性别对应字典.TryAdd("五方银龙铠", "烟罗紫轻绡");
		装备性别对应字典.TryAdd("鸿溟混元铠", "紫翠丹霞衣");
		装备性别对应字典.TryAdd("如意玲珑甲", "月影霓裳衣");
		装备性别对应字典.TryAdd("布裙", "布衣");
		装备性别对应字典.TryAdd("绛紫裙", "虎皮衣");
		装备性别对应字典.TryAdd("虹羽衣", "青铜铠");
		装备性别对应字典.TryAdd("凤暖袍", "皂罗袍");
		装备性别对应字典.TryAdd("锦月袄", "金锁甲");
		装备性别对应字典.TryAdd("凝霜衣", "莽龙袍");
		装备性别对应字典.TryAdd("水合袍", "金丝甲");
		装备性别对应字典.TryAdd("狐皮袄", "八卦衣");
		装备性别对应字典.TryAdd("蛟皮袄", "连环甲");
		装备性别对应字典.TryAdd("天蚕衣", "金缕衣");
		装备性别对应字典.TryAdd("霓裳羽衣", "天衣");
		装备性别对应字典.TryAdd("星晶法衣", "瀚宇法袍");
		装备性别对应字典.TryAdd("神鸢凤裘", "诸天法袍");
		装备性别对应字典.TryAdd("万霞霓罗裳", "天玄真神甲");
		装备性别对应字典.TryAdd("玄女绛绡衣", "赤金磐龙甲");
		装备性别对应字典.TryAdd("凤翼轻裘", "紫金神风甲");
		装备性别对应字典.TryAdd("烟罗紫轻绡", "五方银龙铠");
		装备性别对应字典.TryAdd("紫翠丹霞衣", "鸿溟混元铠");
		装备性别对应字典.TryAdd("月影霓裳衣", "如意玲珑甲");
		equip.TryAdd("云龙枪", new 装备数据表("云龙枪", 80, "蕴雷枪", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("噬魂魔爪", new 装备数据表("噬魂魔爪", 80, "拂兰指", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("九黎剑", new 装备数据表("九黎剑", 80, "轩辕剑", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("蔽日扇", new 装备数据表("蔽日扇", 80, "乾坤扇", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("撼地锤", new 装备数据表("撼地锤", 80, "破天锤", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("冰雪残月刀", new 装备数据表("冰雪残月刀", 80, "神魔幻影刀", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("刺骨玄冥拳套", new 装备数据表("刺骨玄冥拳套", 80, "阴阳八卦拳套", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("邪灵绝钩", new 装备数据表("邪灵绝钩", 80, "无相断魂戟", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("无影弓", new 装备数据表("无影弓", 80, "震天弓", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("玄冥寒冰斧", new 装备数据表("玄冥寒冰斧", 80, "青光碎灵斧", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("炽阳鼓", new 装备数据表("炽阳鼓", 80, "三星盘鼓", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("霜菊法螺", new 装备数据表("霜菊法螺", 80, "翠筠法螺", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("火蛇鞭", new 装备数据表("火蛇鞭", 80, "黄泉骨鞭", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("霜羽刃", new 装备数据表("霜羽刃", 80, "炎翎刃", new List<string>
		{
			"云龙枪", "噬魂魔爪", "九黎剑", "蔽日扇", "撼地锤", "冰雪残月刀", "刺骨玄冥拳套", "邪灵绝钩", "无影弓", "玄冥寒冰斧",
			"炽阳鼓", "霜菊法螺", "火蛇鞭", "霜羽刃"
		}));
		equip.TryAdd("蕴雷枪", new 装备数据表("蕴雷枪", 90, "风火游龙枪", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("拂兰指", new 装备数据表("拂兰指", 90, "啼血爪", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("轩辕剑", new 装备数据表("轩辕剑", 90, "乙木神剑", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("乾坤扇", new 装备数据表("乾坤扇", 90, "五彩神焰扇", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("破天锤", new 装备数据表("破天锤", 90, "加持杵", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("神魔幻影刀", new 装备数据表("神魔幻影刀", 90, "乾坤日月刀", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("阴阳八卦拳套", new 装备数据表("阴阳八卦拳套", 90, "遮天降魔拳套", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("无相断魂戟", new 装备数据表("无相断魂戟", 90, "戮仙双钩", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("震天弓", new 装备数据表("震天弓", 90, "龙舌断魂弓", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("青光碎灵斧", new 装备数据表("青光碎灵斧", 90, "鬼魅残影斧", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("三星盘鼓", new 装备数据表("三星盘鼓", 90, "飞熊渔鼓", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("翠筠法螺", new 装备数据表("翠筠法螺", 90, "幽兰法螺", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("黄泉骨鞭", new 装备数据表("黄泉骨鞭", 90, "血煞炎鞭", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("炎翎刃", new 装备数据表("炎翎刃", 90, "幽翎影刃", new List<string>
		{
			"蕴雷枪", "拂兰指", "轩辕剑", "乾坤扇", "破天锤", "神魔幻影刀", "阴阳八卦拳套", "无相断魂戟", "震天弓", "青光碎灵斧",
			"三星盘鼓", "翠筠法螺", "黄泉骨鞭", "炎翎刃"
		}));
		equip.TryAdd("风火游龙枪", new 装备数据表("风火游龙枪", 100, "九转金刚刃", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("啼血爪", new 装备数据表("啼血爪", 100, "七巧玲珑爪", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("乙木神剑", new 装备数据表("乙木神剑", 100, "紫青玄魔剑", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("五彩神焰扇", new 装备数据表("五彩神焰扇", 100, "离火七翎扇", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("加持杵", new 装备数据表("加持杵", 100, "炼狱麒麟杵", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("乾坤日月刀", new 装备数据表("乾坤日月刀", 100, "沉虹连斩刀", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("遮天降魔拳套", new 装备数据表("遮天降魔拳套", 100, "鬼藏惊鸿拳套", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("戮仙双钩", new 装备数据表("戮仙双钩", 100, "屠魔追风戟", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("龙舌断魂弓", new 装备数据表("龙舌断魂弓", 100, "追魂嗜魄弓", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("鬼魅残影斧", new 装备数据表("鬼魅残影斧", 100, "烈焰凤头斧", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("飞熊渔鼓", new 装备数据表("飞熊渔鼓", 100, "八卦铜鼓", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("幽兰法螺", new 装备数据表("幽兰法螺", 100, "雪梅法螺", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("血煞炎鞭", new 装备数据表("血煞炎鞭", 100, "碧落竹鞭", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("幽翎影刃", new 装备数据表("幽翎影刃", 100, "残翎血刃", new List<string>
		{
			"风火游龙枪", "啼血爪", "乙木神剑", "五彩神焰扇", "加持杵", "乾坤日月刀", "遮天降魔拳套", "戮仙双钩", "龙舌断魂弓", "鬼魅残影斧",
			"飞熊渔鼓", "幽兰法螺", "血煞炎鞭", "幽翎影刃"
		}));
		equip.TryAdd("九转金刚刃", new 装备数据表("九转金刚刃", 110, "混元斩龙戟", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("七巧玲珑爪", new 装备数据表("七巧玲珑爪", 110, "镇魂摄天刺", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("紫青玄魔剑", new 装备数据表("紫青玄魔剑", 110, "封神诛仙剑", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("离火七翎扇", new 装备数据表("离火七翎扇", 110, "赤霄烈焰扇", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("炼狱麒麟杵", new 装备数据表("炼狱麒麟杵", 110, "风雷如意杵", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("沉虹连斩刀", new 装备数据表("沉虹连斩刀", 110, "银龙锁月刀", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("鬼藏惊鸿拳套", new 装备数据表("鬼藏惊鸿拳套", 110, "孤星流魂拳套", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("屠魔追风戟", new 装备数据表("屠魔追风戟", 110, "兽灵吞日钩", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("追魂嗜魄弓", new 装备数据表("追魂嗜魄弓", 110, "轩辕飞羽弓", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("烈焰凤头斧", new 装备数据表("烈焰凤头斧", 110, "蓝宝旋风斧", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("八卦铜鼓", new 装备数据表("八卦铜鼓", 110, "凤舞长空", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("雪梅法螺", new 装备数据表("雪梅法螺", 110, "蝶梦潇湘", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("碧落竹鞭", new 装备数据表("碧落竹鞭", 110, "赤练无痕", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("残翎血刃", new 装备数据表("残翎血刃", 110, "森罗月刃", new List<string>
		{
			"九转金刚刃", "七巧玲珑爪", "紫青玄魔剑", "离火七翎扇", "炼狱麒麟杵", "沉虹连斩刀", "鬼藏惊鸿拳套", "屠魔追风戟", "追魂嗜魄弓", "烈焰凤头斧",
			"八卦铜鼓", "雪梅法螺", "碧落竹鞭", "残翎血刃"
		}));
		equip.TryAdd("混元斩龙戟", new 装备数据表("混元斩龙戟", 120, "赤眼神龙枪", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("镇魂摄天刺", new 装备数据表("镇魂摄天刺", 120, "红绫火毒爪", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("封神诛仙剑", new 装备数据表("封神诛仙剑", 120, "九天玄冥剑", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("赤霄烈焰扇", new 装备数据表("赤霄烈焰扇", 120, "红云火霞扇", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("风雷如意杵", new 装备数据表("风雷如意杵", 120, "玄黄破坚锤", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("银龙锁月刀", new 装备数据表("银龙锁月刀", 120, "三苗九藜刀", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("孤星流魂拳套", new 装备数据表("孤星流魂拳套", 120, "震臂罗刹拳套", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("兽灵吞日钩", new 装备数据表("兽灵吞日钩", 120, "蛟龙翻天戟", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("轩辕飞羽弓", new 装备数据表("轩辕飞羽弓", 120, "落日闭月弓", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("蓝宝旋风斧", new 装备数据表("蓝宝旋风斧", 120, "飞龙破天斧", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("凤舞长空", new 装备数据表("凤舞长空", 120, "玄螭幻音", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("蝶梦潇湘", new 装备数据表("蝶梦潇湘", 120, "啸海逐波", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("赤练无痕", new 装备数据表("赤练无痕", 120, "烟锁横江", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("森罗月刃", new 装备数据表("森罗月刃", 120, "追魂泣血", new List<string>
		{
			"混元斩龙戟", "镇魂摄天刺", "封神诛仙剑", "赤霄烈焰扇", "风雷如意杵", "银龙锁月刀", "孤星流魂拳套", "兽灵吞日钩", "轩辕飞羽弓", "蓝宝旋风斧",
			"凤舞长空", "蝶梦潇湘", "赤练无痕", "森罗月刃"
		}));
		equip.TryAdd("赤眼神龙枪", new 装备数据表("赤眼神龙枪", 130, "九天祥云戟", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("红绫火毒爪", new 装备数据表("红绫火毒爪", 130, "九幽伏魔爪", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("九天玄冥剑", new 装备数据表("九天玄冥剑", 130, "赤魇遁龙剑", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("红云火霞扇", new 装备数据表("红云火霞扇", 130, "熠焰通灵扇", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("玄黄破坚锤", new 装备数据表("玄黄破坚锤", 130, "玄天火龙锤", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("三苗九藜刀", new 装备数据表("三苗九藜刀", 130, "洪荒苍龙刀", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("震臂罗刹拳套", new 装备数据表("震臂罗刹拳套", 130, "烈焰之心拳套", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("蛟龙翻天戟", new 装备数据表("蛟龙翻天戟", 130, "鬼神烈双钩", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("落日闭月弓", new 装备数据表("落日闭月弓", 130, "流月飞星弓", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("飞龙破天斧", new 装备数据表("飞龙破天斧", 130, "烈焰屠魔斧", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("玄螭幻音", new 装备数据表("玄螭幻音", 130, "墨玉祥龙鼓", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("啸海逐波", new 装备数据表("啸海逐波", 130, "瀚海鲸涛", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("烟锁横江", new 装备数据表("烟锁横江", 130, "烈火麒麟鞭", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("追魂泣血", new 装备数据表("追魂泣血", 130, "电掣惊雷刃", new List<string>
		{
			"赤眼神龙枪", "红绫火毒爪", "九天玄冥剑", "红云火霞扇", "玄黄破坚锤", "三苗九藜刀", "震臂罗刹拳套", "蛟龙翻天戟", "落日闭月弓", "飞龙破天斧",
			"玄螭幻音", "啸海逐波", "烟锁横江", "追魂泣血"
		}));
		equip.TryAdd("九天祥云戟", new 装备数据表("九天祥云戟", 140, "赤封侠胆戟", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("九幽伏魔爪", new 装备数据表("九幽伏魔爪", 140, "刺骨追魂爪", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("赤魇遁龙剑", new 装备数据表("赤魇遁龙剑", 140, "聚灵神风剑", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("熠焰通灵扇", new 装备数据表("熠焰通灵扇", 140, "降魔诛宇扇", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("玄天火龙锤", new 装备数据表("玄天火龙锤", 140, "四海镇天锤", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("洪荒苍龙刀", new 装备数据表("洪荒苍龙刀", 140, "凤舞梦魇刀", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("烈焰之心拳套", new 装备数据表("烈焰之心拳套", 140, "五灵单符拳套", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("鬼神烈双钩", new 装备数据表("鬼神烈双钩", 140, "寒冰陷地戟", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("流月飞星弓", new 装备数据表("流月飞星弓", 140, "蛟龙玄铁弓", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("烈焰屠魔斧", new 装备数据表("烈焰屠魔斧", 140, "戮鬼祭天斧", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("墨玉祥龙鼓", new 装备数据表("墨玉祥龙鼓", 140, "星海云纹鼓", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("瀚海鲸涛", new 装备数据表("瀚海鲸涛", 140, "七曜摄天", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("烈火麒麟鞭", new 装备数据表("烈火麒麟鞭", 140, "泣血凰炎鞭", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("电掣惊雷刃", new 装备数据表("电掣惊雷刃", 140, "鲲鹏流星刃", new List<string>
		{
			"九天祥云戟", "九幽伏魔爪", "赤魇遁龙剑", "熠焰通灵扇", "玄天火龙锤", "洪荒苍龙刀", "烈焰之心拳套", "鬼神烈双钩", "流月飞星弓", "烈焰屠魔斧",
			"墨玉祥龙鼓", "瀚海鲸涛", "烈火麒麟鞭", "电掣惊雷刃"
		}));
		equip.TryAdd("赤封侠胆戟", new 装备数据表("赤封侠胆戟", 150, "天赐鸿福枪", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("刺骨追魂爪", new 装备数据表("刺骨追魂爪", 150, "赤目锥心爪", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("聚灵神风剑", new 装备数据表("聚灵神风剑", 150, "倚天玄霜剑", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("降魔诛宇扇", new 装备数据表("降魔诛宇扇", 150, "幽冥天使扇", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("四海镇天锤", new 装备数据表("四海镇天锤", 150, "九天炼狱锤", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("凤舞梦魇刀", new 装备数据表("凤舞梦魇刀", 150, "屠龙旋幽刀", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("五灵单符拳套", new 装备数据表("五灵单符拳套", 150, "煞仙封魔拳套", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("寒冰陷地戟", new 装备数据表("寒冰陷地戟", 150, "玄幽凤舞戟", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("蛟龙玄铁弓", new 装备数据表("蛟龙玄铁弓", 150, "邪龙灭世弓", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("戮鬼祭天斧", new 装备数据表("戮鬼祭天斧", 150, "黑暗火凤斧", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("星海云纹鼓", new 装备数据表("星海云纹鼓", 150, "炽焰飞虹鼓", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("七曜摄天", new 装备数据表("七曜摄天", 150, "日月玄晖", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("泣血凰炎鞭", new 装备数据表("泣血凰炎鞭", 150, "炽焰龙鳞鞭", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("鲲鹏流星刃", new 装备数据表("鲲鹏流星刃", 150, "凤舞寒月刃", new List<string>
		{
			"赤封侠胆戟", "刺骨追魂爪", "聚灵神风剑", "降魔诛宇扇", "四海镇天锤", "凤舞梦魇刀", "五灵单符拳套", "寒冰陷地戟", "蛟龙玄铁弓", "戮鬼祭天斧",
			"星海云纹鼓", "七曜摄天", "泣血凰炎鞭", "鲲鹏流星刃"
		}));
		equip.TryAdd("天赐鸿福枪", new 装备数据表("天赐鸿福枪", 160, "白虹贯日枪", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("赤目锥心爪", new 装备数据表("赤目锥心爪", 160, "蚀骨绝殇爪", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("倚天玄霜剑", new 装备数据表("倚天玄霜剑", 160, "紫宸仙霞剑", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("幽冥天使扇", new 装备数据表("幽冥天使扇", 160, "参商拓风扇", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("九天炼狱锤", new 装备数据表("九天炼狱锤", 160, "魔枭嗜血锤", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("屠龙旋幽刀", new 装备数据表("屠龙旋幽刀", 160, "娲皇戮魂刀", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("煞仙封魔拳套", new 装备数据表("煞仙封魔拳套", 160, "钧天弑神指", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("玄幽凤舞戟", new 装备数据表("玄幽凤舞戟", 160, "啸海逐浪戟", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("邪龙灭世弓", new 装备数据表("邪龙灭世弓", 160, "荧惑堕天弓", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("黑暗火凤斧", new 装备数据表("黑暗火凤斧", 160, "凰炎烈天斧", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("炽焰飞虹鼓", new 装备数据表("炽焰飞虹鼓", 160, "暮鼓青霄", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("日月玄晖", new 装备数据表("日月玄晖", 160, "凤鸣九霄", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("炽焰龙鳞鞭", new 装备数据表("炽焰龙鳞鞭", 160, "星火长明", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("凤舞寒月刃", new 装备数据表("凤舞寒月刃", 160, "渊鸿归寂", new List<string>
		{
			"天赐鸿福枪", "赤目锥心爪", "倚天玄霜剑", "幽冥天使扇", "九天炼狱锤", "屠龙旋幽刀", "煞仙封魔拳套", "玄幽凤舞戟", "邪龙灭世弓", "黑暗火凤斧",
			"炽焰飞虹鼓", "日月玄晖", "炽焰龙鳞鞭", "凤舞寒月刃"
		}));
		equip.TryAdd("白虹贯日枪", new 装备数据表("白虹贯日枪", 170, "天狼晦日枪", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("蚀骨绝殇爪", new 装备数据表("蚀骨绝殇爪", 170, "虎啸八荒爪", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("紫宸仙霞剑", new 装备数据表("紫宸仙霞剑", 170, "莫邪青云剑", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("参商拓风扇", new 装备数据表("参商拓风扇", 170, "三昧神火扇", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("魔枭嗜血锤", new 装备数据表("魔枭嗜血锤", 170, "紫电乌龙锤", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("娲皇戮魂刀", new 装备数据表("娲皇戮魂刀", 170, "斩仙化血刀", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("钧天弑神指", new 装备数据表("钧天弑神指", 170, "血影攒心指", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("啸海逐浪戟", new 装备数据表("啸海逐浪戟", 170, "星海含光戟", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("荧惑堕天弓", new 装备数据表("荧惑堕天弓", 170, "射日乾坤弓", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("凰炎烈天斧", new 装备数据表("凰炎烈天斧", 170, "混元开天斧", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("暮鼓青霄", new 装备数据表("暮鼓青霄", 170, "惊雷绝响", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("凤鸣九霄", new 装备数据表("凤鸣九霄", 170, "雷动八荒", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("星火长明", new 装备数据表("星火长明", 170, "逐月流星", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("渊鸿归寂", new 装备数据表("渊鸿归寂", 170, "鸣鹏惊宇", new List<string>
		{
			"白虹贯日枪", "蚀骨绝殇爪", "紫宸仙霞剑", "参商拓风扇", "魔枭嗜血锤", "娲皇戮魂刀", "钧天弑神指", "啸海逐浪戟", "荧惑堕天弓", "凰炎烈天斧",
			"暮鼓青霄", "凤鸣九霄", "星火长明", "渊鸿归寂"
		}));
		equip.TryAdd("天狼晦日枪", new 装备数据表("天狼晦日枪", 180, "天狼晦日枪", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("虎啸八荒爪", new 装备数据表("虎啸八荒爪", 180, "虎啸八荒爪", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("莫邪青云剑", new 装备数据表("莫邪青云剑", 180, "莫邪青云剑", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("三昧神火扇", new 装备数据表("三昧神火扇", 180, "三昧神火扇", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("紫电乌龙锤", new 装备数据表("紫电乌龙锤", 180, "紫电乌龙锤", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("斩仙化血刀", new 装备数据表("斩仙化血刀", 180, "斩仙化血刀", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("血影攒心指", new 装备数据表("血影攒心指", 180, "血影攒心指", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("星海含光戟", new 装备数据表("星海含光戟", 180, "星海含光戟", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("射日乾坤弓", new 装备数据表("射日乾坤弓", 180, "射日乾坤弓", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("混元开天斧", new 装备数据表("混元开天斧", 180, "混元开天斧", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("惊雷绝响", new 装备数据表("惊雷绝响", 180, "惊雷绝响", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("雷动八荒", new 装备数据表("雷动八荒", 180, "雷动八荒", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("逐月流星", new 装备数据表("逐月流星", 180, "逐月流星", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		equip.TryAdd("鸣鹏惊宇", new 装备数据表("鸣鹏惊宇", 180, "鸣鹏惊宇", new List<string>
		{
			"天狼晦日枪", "虎啸八荒爪", "莫邪青云剑", "三昧神火扇", "紫电乌龙锤", "斩仙化血刀", "血影攒心指", "星海含光戟", "射日乾坤弓", "混元开天斧",
			"惊雷绝响", "雷动八荒", "逐月流星", "鸣鹏惊宇"
		}));
		出生地图列表.TryAdd("天墉城", "\"/tianyongcheng/tianyongcheng.c\"");
		出生地图列表.TryAdd("揽仙镇", "\"/lanxianzhen/lanxianzhen.c\"");
		出生地图列表.TryAdd("揽仙镇外", "\"/lanxianzhenwai/lanxianzhenwai.c\"");
		出生地图列表.TryAdd("天上集市", "\"/tianshangjishi/tianshangjishi.c\"");
		GM权限请求包头组.Add(16688);
		GM权限请求包头组.Add(8708);
		GM权限请求包头组.Add(28682);
		GM权限请求包头组.Add(12316);
		GM权限请求包头组.Add(6908);
		GM权限请求包头组.Add(24578);
		GM权限请求包头组.Add(9282);
		GM权限请求包头组.Add(8980);
		GM权限请求包头组.Add(26);
		GM权限请求包头组.Add(97);
		GM权限请求包头组.Add(9028);
		GM权限请求包头组.Add(8566);
		前缀字典.TryAdd("「晚睡境」", 1);
		前缀字典.TryAdd("「熬夜境」", 2);
		前缀字典.TryAdd("「通宵境」", 3);
		前缀字典.TryAdd("「肾虚境」", 4);
		前缀字典.TryAdd("「猝死境」", 5);
		前缀字典.TryAdd("「合棺境」", 6);
		前缀字典.TryAdd("「地葬境」", 7);
		前缀字典.TryAdd("「化骨境」", 8);
		前缀字典.TryAdd("「归尘境」", 9);
		前缀字典.TryAdd("「轮回境」", 10);
		属性字典.TryAdd("伤害", "power");
		属性字典.TryAdd("物理伤害", "phy_power");
		属性字典.TryAdd("法术伤害", "mag_power");
		属性字典.TryAdd("防御", "def");
		属性字典.TryAdd("气血", "max_life");
		属性字典.TryAdd("法力", "max_mana");
		属性字典.TryAdd("速度", "speed");
		属性字典.TryAdd("力量", "str");
		属性字典.TryAdd("体质", "con");
		属性字典.TryAdd("灵力", "wiz");
		属性字典.TryAdd("敏捷", "dex");
		属性字典.TryAdd("所有属性", "all_attrib");
		属性字典.TryAdd("准确", "accurate");
		属性字典.TryAdd("连击率", "double_hit_rate");
		属性字典.TryAdd("反击率", "counter_attack_rate");
		属性字典.TryAdd("物理必杀率", "stunt_rate");
		属性字典.TryAdd("反震率", "damage_sel_rate");
		属性字典.TryAdd("连击", "double_hit");
		属性字典.TryAdd("反击", "counter_attack");
		属性字典.TryAdd("反震度", "damage_sel");
		属性字典.TryAdd("金相性", "metal");
		属性字典.TryAdd("木相性", "wood");
		属性字典.TryAdd("水相性", "water");
		属性字典.TryAdd("火相性", "fire");
		属性字典.TryAdd("土相性", "earth");
		属性字典.TryAdd("金抗性", "resist_metal");
		属性字典.TryAdd("木抗性", "resist_wood");
		属性字典.TryAdd("水抗性", "resist_water");
		属性字典.TryAdd("火抗性", "resist_fire");
		属性字典.TryAdd("土抗性", "resist_earth");
		属性字典.TryAdd("抗中毒", "resist_poison");
		属性字典.TryAdd("抗冰冻", "resist_frozen");
		属性字典.TryAdd("抗昏睡", "resist_sleep");
		属性字典.TryAdd("抗遗忘", "resist_forgotten");
		属性字典.TryAdd("抗混乱", "resist_confusion");
		属性字典.TryAdd("所有相性", "all_polar");
		属性字典.TryAdd("所有抗性", "all_resist_polar");
		属性字典.TryAdd("抗所有异常", "all_resist_except");
		属性字典.TryAdd("所有技能上升", "all_skill");
		属性字典.TryAdd("忽视所有抗性", "ignore_all_resist_polar");
		属性字典.TryAdd("忽视所有抗异常", "ignore_all_resist_except");
		属性字典.TryAdd("忽视目标抗遗忘", "ignore_resist_forgotten");
		属性字典.TryAdd("忽视目标抗中毒", "ignore_resist_poison");
		属性字典.TryAdd("忽视目标抗冰冻", "ignore_resist_frozen");
		属性字典.TryAdd("忽视目标抗昏睡", "ignore_resist_sleep");
		属性字典.TryAdd("忽视目标抗混乱", "ignore_resist_confusion");
		属性字典.TryAdd("忽视目标抗金", "ignore_resist_metal");
		属性字典.TryAdd("忽视目标抗木", "ignore_resist_wood");
		属性字典.TryAdd("忽视目标抗水", "ignore_resist_water");
		属性字典.TryAdd("忽视目标抗火", "ignore_resist_fire");
		属性字典.TryAdd("忽视目标抗土", "ignore_resist_earth");
		属性字典.TryAdd("忽视目标连击", "ignore_double_hit_rate");
		属性字典.TryAdd("忽视目标物理必杀", "ignore_stunt_rate");
		属性字典.TryAdd("强力克金", "super_excluse_metal");
		属性字典.TryAdd("强力克木", "super_excluse_wood");
		属性字典.TryAdd("强力克水", "super_excluse_water");
		属性字典.TryAdd("强力克火", "super_excluse_fire");
		属性字典.TryAdd("强力克土", "super_excluse_earth");
		属性字典.TryAdd("强金法伤害", "enhanced_metal");
		属性字典.TryAdd("强木法伤害", "enhanced_wood");
		属性字典.TryAdd("强水法伤害", "enhanced_water");
		属性字典.TryAdd("强火法伤害", "enhanced_fire");
		属性字典.TryAdd("强土法伤害", "enhanced_earth");
		属性字典.TryAdd("躲避攻击", "mag_dodge");
		属性字典.TryAdd("师门攻击技能消耗降低", "B_skill_low_cost");
		属性字典.TryAdd("师门障碍技能消耗降低", "C_skill_low_cost");
		属性字典.TryAdd("师门辅助技能消耗降低", "D_skill_low_cost");
		属性字典.TryAdd("强力遗忘", "super_forgotten");
		属性字典.TryAdd("强力中毒", "super_poison");
		属性字典.TryAdd("强力冰冻", "super_frozen");
		属性字典.TryAdd("强力昏睡", "super_sleep");
		属性字典.TryAdd("强力混乱", "super_confusion");
		属性字典.TryAdd("解除遗忘状态", "release_forgotten");
		属性字典.TryAdd("解除中毒状态", "release_poison");
		属性字典.TryAdd("解除冰冻状态", "release_frozen");
		属性字典.TryAdd("解除昏睡状态", "release_sleep");
		属性字典.TryAdd("解除混乱状态", "release_confusion");
		属性字典.TryAdd("忽视躲避攻击", "ignore_mag_dodge");
		属性字典.TryAdd("破防率", "penetrate_rate");
		属性字典.TryAdd("破防", "penetrate");
		属性字典.TryAdd("强物理伤害", "enhanced_phy");
		属性字典.TryAdd("法术必杀率", "mstunt_rate");
		属性字典.TryAdd("忽视目标法术必杀", "ignore_mstunt_rate");
		属性字典.TryAdd("金光乍现反击率", "counter_attack_jgzx");
		属性字典.TryAdd("摘叶飞花反击率", "counter_attack_zyfh");
		属性字典.TryAdd("滴水穿石反击率", "counter_attack_dscs");
		属性字典.TryAdd("举火焚天反击率", "counter_attack_jhft");
		属性字典.TryAdd("落土飞岩反击率", "counter_attack_ltfy");
		属性字典.TryAdd("抗神圣之光", "resist_shenszg");
		属性字典.TryAdd("抗游说之舌", "resist_youszs");
		属性字典.TryAdd("抗舍命一击", "resist_shemyj");
		属性字典.TryAdd("抗翻转乾坤", "resist_fanzqk");
		属性字典.TryAdd("抗漫天血舞", "resist_mantxw");
		属性字典.TryAdd("抗物理", "phy_absorb");
		属性字典.TryAdd("抗法术", "mag_absorb");
		属性字典.TryAdd("抗镇魂", "resist_repress");
		属性字典.TryAdd("抗化功", "resist_melt");
		属性字典.TryAdd("抗水牢", "resist_cage");
		属性字典.TryAdd("抗锁灵", "resist_lock");
		属性字典.TryAdd("抗迷心", "resist_lost");
		属性字典.TryAdd("忽视目标抗镇魂", "ignore_resist_repress");
		属性字典.TryAdd("忽视目标抗化功", "ignore_resist_melt");
		属性字典.TryAdd("忽视目标抗水牢", "ignore_resist_cage");
		属性字典.TryAdd("忽视目标抗锁灵", "ignore_resist_lock");
		属性字典.TryAdd("忽视目标抗迷心", "ignore_resist_lost");
		属性字典.TryAdd("解除镇魂状态", "release_repress");
		属性字典.TryAdd("解除化功状态", "release_melt");
		属性字典.TryAdd("解除水牢状态", "release_cage");
		属性字典.TryAdd("解除锁灵状态", "release_lock");
		属性字典.TryAdd("解除迷心状态", "release_lost");
		属性字典.TryAdd("强力镇魂", "super_repress");
		属性字典.TryAdd("强力化功", "super_melt");
		属性字典.TryAdd("强力水牢", "super_cage");
		属性字典.TryAdd("强力锁灵", "super_lock");
		属性字典.TryAdd("强力迷心", "super_lost");
		属性字典.TryAdd("闪避", "base_dodge");
		属性字典.TryAdd("出其不意", "gb_chuqby");
		属性字典.TryAdd("无法无天", "gb_wufwt");
		属性字典.TryAdd("辅助之力", "gb_fuzzl");
		属性字典.TryAdd("重生", "gb_chongs");
		属性字典.TryAdd("强力障碍宠物", "super_obstruct");
		属性字典.TryAdd("出战化形", "super_obstruct");
		宠物分类字典.TryAdd("青蛙", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("松鼠", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("兔子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蛇", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("猴子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("山猫", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("狐狸", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("野狗", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("桃精", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("柳鬼", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("白猿", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("鹰", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蝙蝠", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蟒", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("僵尸", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("鬼火萤", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("乌龙", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("花妖", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("炎龙", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("鱼人", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("冰龙", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("地裂兽", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("青龙", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("金头陀", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("黄龙", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("火鸦", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("屈魂", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("怨鬼", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("粉衣仙子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("电精", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("青衣仙子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("雨兽", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("黄衣仙子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("风怪", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("红衣仙子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("虹妖", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("紫衣仙子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("雪女", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蓝衣仙子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("云兽", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("白衣仙子", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("雷怪", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("石牛妖", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("骷髅战将", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蓝毛巨兽", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("螳螂怪", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("三头巨犬", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("嗜血巨人", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("炼魔", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("寒冰怪", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("虾兵", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蟹将", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("海龟", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("狼", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("老虎", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("巨蜥", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("石魔", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("火光鼠", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("紫燕", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("冰晶龙鳞兽", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("金翅鸢", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("雪狐", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("剑魂", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("狰兽", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蝶仙", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("蚌姬", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("水魔神", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("金甲蝎", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("斗魔蜥", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("化蛇兽", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("狐灵", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("壳妖", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("符灵", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("棋灵", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("侍书者", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("金刚星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("木魂星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("水柔星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("火烈星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("土暴星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("锦辰兔", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("紫云兔", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("月蓝兔", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("赤焰兔", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("碧玉兔", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("幽冥血蛇", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("百年黑熊", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("北冥幼狮", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("玄天刺猬", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("血幻豪猪", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("金福星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("紫福星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("兰福星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("红福星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("黄福星", AllEnums.宠物Type.普通);
		宠物分类字典.TryAdd("桂花", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("重明", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("独角仙", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("饕餮", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("龟宝", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("乖乖狗", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("囚牛", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("鳌鱼", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("溜溜马", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("南瓜头杰克", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("花玉簪", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("君子幽兰", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("球球", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("跳跳兔", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("豆蔻", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("狴犴", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("咩咩羊", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("酷酷龙", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("英招", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("牡丹花", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("莲花", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("蛋蛋鸡", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("茉莉", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("幻化月蓝兔", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("白泽", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("药兽", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("昙花", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("幻化赤焰兔", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("飞廉", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("幻化锦辰兔", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("笨笨牛", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("禾雀", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("蒲牢", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("威威虎", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("伶俐鼠", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("方相", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("貔貅", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("风狸", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("幻化碧玉兔", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("当康", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("嘲风", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("月见草", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("花花蛇", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("幻化紫云兔", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("帅帅猴", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("月季", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("睚眦", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("乘黄", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("招财猪", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("霸下", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("玉兰", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("腓腓", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("比翼鸟", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("飞天鼠", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("玄灵兔", AllEnums.宠物Type.变异);
		宠物分类字典.TryAdd("至尊威威虎", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊伶俐鼠", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊帅帅猴", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊酷酷龙", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊乖乖狗", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊蛋蛋鸡", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("东山神灵", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊笨笨牛", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("六合", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("穷奇", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("句芒", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("玄冥", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("祝融", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("九尾狐", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("朱雀", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊溜溜马", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊跳跳兔", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("后土", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("玄武", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("螣蛇", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊花花蛇", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("勾陈", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("疆良", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊咩咩羊", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("至尊招财猪", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("蓐收", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("麒麟", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("圣诞球球", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("九耳", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("甜粽仙", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("咸粽仙", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("嫦娥", AllEnums.宠物Type.神兽);
		宠物分类字典.TryAdd("震魃", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("赤天", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("降魔", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("夫诸", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("混沌", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("大力神猪", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("笛舞", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("齐天大圣", AllEnums.宠物Type.元灵);
		宠物分类字典.TryAdd("巨力", AllEnums.宠物Type.仙元);
		宠物分类字典.TryAdd("苍穹", AllEnums.宠物Type.仙元);
		宠物分类字典.TryAdd("逐鹿", AllEnums.宠物Type.仙元);
		宠物分类字典.TryAdd("斗战胜佛", AllEnums.宠物Type.仙元);
		宠物分类字典.TryAdd("无名", AllEnums.宠物Type.仙元);
		宠物分类字典.TryAdd("净瓶", AllEnums.宠物Type.仙元);
		宠物分类字典.TryAdd("昆仑", AllEnums.宠物Type.仙元);
		宠物分类字典.TryAdd("炼狱狂魔", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("炼狱灵魔", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("炼狱血魔", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("炼狱风魔", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("力獒", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("灵獒", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("血獒", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("风獒", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("魅魂", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("魅灵", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("血魅", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("鬼魅", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("阴阳狂师", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("阴阳魔师", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("阴阳血师", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("阴阳气师", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("血丹狂魂", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("血丹魔魂", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("血丹凶魂", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("血丹风魂", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("牛头狱卒", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("马面罗刹", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("范无救", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("谢必安", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("地府守卫", AllEnums.宠物Type.鬼宠);
		宠物分类字典.TryAdd("阎摩", AllEnums.宠物Type.鬼宠);
		怀旧技能字典.TryAdd(2011, 11);
		怀旧技能字典.TryAdd(2012, 12);
		怀旧技能字典.TryAdd(2013, 13);
		怀旧技能字典.TryAdd(2014, 14);
		怀旧技能字典.TryAdd(2015, 15);
		怀旧技能字典.TryAdd(2016, 21);
		怀旧技能字典.TryAdd(2017, 22);
		怀旧技能字典.TryAdd(2018, 23);
		怀旧技能字典.TryAdd(2019, 24);
		怀旧技能字典.TryAdd(2020, 25);
		怀旧技能字典.TryAdd(2021, 31);
		怀旧技能字典.TryAdd(2022, 32);
		怀旧技能字典.TryAdd(2023, 33);
		怀旧技能字典.TryAdd(2024, 34);
		怀旧技能字典.TryAdd(2025, 35);
		怀旧技能字典.TryAdd(2061, 61);
		怀旧技能字典.TryAdd(2062, 62);
		怀旧技能字典.TryAdd(2063, 63);
		怀旧技能字典.TryAdd(2064, 64);
		怀旧技能字典.TryAdd(2065, 65);
		怀旧技能字典.TryAdd(2071, 71);
		怀旧技能字典.TryAdd(2072, 72);
		怀旧技能字典.TryAdd(2073, 73);
		怀旧技能字典.TryAdd(2074, 74);
		怀旧技能字典.TryAdd(2075, 75);
		怀旧技能字典.TryAdd(2081, 81);
		怀旧技能字典.TryAdd(2082, 82);
		怀旧技能字典.TryAdd(2083, 83);
		怀旧技能字典.TryAdd(2084, 84);
		怀旧技能字典.TryAdd(2085, 85);
		怀旧技能字典.TryAdd(2110, 110);
		怀旧技能字典.TryAdd(2111, 111);
		怀旧技能字典.TryAdd(2112, 112);
		怀旧技能字典.TryAdd(2113, 113);
		怀旧技能字典.TryAdd(2114, 114);
		怀旧技能字典.TryAdd(2121, 121);
		怀旧技能字典.TryAdd(2122, 122);
		怀旧技能字典.TryAdd(2123, 123);
		怀旧技能字典.TryAdd(2124, 124);
		怀旧技能字典.TryAdd(2125, 125);
		怀旧技能字典.TryAdd(2131, 131);
		怀旧技能字典.TryAdd(2132, 132);
		怀旧技能字典.TryAdd(2133, 133);
		怀旧技能字典.TryAdd(2134, 134);
		怀旧技能字典.TryAdd(2135, 135);
		怀旧技能字典.TryAdd(2161, 161);
		怀旧技能字典.TryAdd(2162, 162);
		怀旧技能字典.TryAdd(2163, 163);
		怀旧技能字典.TryAdd(2164, 164);
		怀旧技能字典.TryAdd(2165, 165);
		怀旧技能字典.TryAdd(2171, 171);
		怀旧技能字典.TryAdd(2172, 172);
		怀旧技能字典.TryAdd(2173, 173);
		怀旧技能字典.TryAdd(2174, 174);
		怀旧技能字典.TryAdd(2175, 175);
		怀旧技能字典.TryAdd(2181, 181);
		怀旧技能字典.TryAdd(2182, 182);
		怀旧技能字典.TryAdd(2183, 183);
		怀旧技能字典.TryAdd(2184, 184);
		怀旧技能字典.TryAdd(2185, 185);
		怀旧技能字典.TryAdd(2210, 210);
		怀旧技能字典.TryAdd(2211, 211);
		怀旧技能字典.TryAdd(2212, 212);
		怀旧技能字典.TryAdd(2213, 213);
		怀旧技能字典.TryAdd(2214, 214);
		怀旧技能字典.TryAdd(2221, 221);
		怀旧技能字典.TryAdd(2222, 222);
		怀旧技能字典.TryAdd(2223, 223);
		怀旧技能字典.TryAdd(2224, 224);
		怀旧技能字典.TryAdd(2225, 225);
		怀旧技能字典.TryAdd(2231, 231);
		怀旧技能字典.TryAdd(2232, 232);
		怀旧技能字典.TryAdd(2233, 233);
		怀旧技能字典.TryAdd(2234, 234);
		怀旧技能字典.TryAdd(2235, 235);
		所有技能ID.TryAdd("金遁术", 2);
		所有技能ID.TryAdd("金光乍现", 11);
		所有技能ID.TryAdd("刀光剑影", 12);
		所有技能ID.TryAdd("金虹贯日", 13);
		所有技能ID.TryAdd("流光异彩", 14);
		所有技能ID.TryAdd("逆天残刃", 15);
		所有技能ID.TryAdd("流连忘返", 21);
		所有技能ID.TryAdd("得意忘形", 22);
		所有技能ID.TryAdd("如痴如醉", 23);
		所有技能ID.TryAdd("如梦初醒", 24);
		所有技能ID.TryAdd("恍若隔世", 25);
		所有技能ID.TryAdd("天生神力", 31);
		所有技能ID.TryAdd("气冲斗牛", 32);
		所有技能ID.TryAdd("九牛二虎", 33);
		所有技能ID.TryAdd("如虎添翼", 34);
		所有技能ID.TryAdd("力挽狂澜", 35);
		所有技能ID.TryAdd("木遁术", 52);
		所有技能ID.TryAdd("摘叶飞花", 61);
		所有技能ID.TryAdd("飞柳仙矢", 62);
		所有技能ID.TryAdd("盘根错节", 63);
		所有技能ID.TryAdd("落英缤纷", 64);
		所有技能ID.TryAdd("鬼舞枯藤", 65);
		所有技能ID.TryAdd("见血封喉", 71);
		所有技能ID.TryAdd("蛇口蜂针", 72);
		所有技能ID.TryAdd("鹤顶红粉", 73);
		所有技能ID.TryAdd("蝎尾蛇涎", 74);
		所有技能ID.TryAdd("万蚁噬心", 75);
		所有技能ID.TryAdd("拔苗助长", 81);
		所有技能ID.TryAdd("火上浇油", 82);
		所有技能ID.TryAdd("水涨船高", 83);
		所有技能ID.TryAdd("红花绿叶", 84);
		所有技能ID.TryAdd("锦上添花", 85);
		所有技能ID.TryAdd("水遁术", 102);
		所有技能ID.TryAdd("滴水穿石", 110);
		所有技能ID.TryAdd("雨恨云愁", 111);
		所有技能ID.TryAdd("悬河泻水", 112);
		所有技能ID.TryAdd("怒波狂涛", 113);
		所有技能ID.TryAdd("搅海翻江", 114);
		所有技能ID.TryAdd("三九严寒", 121);
		所有技能ID.TryAdd("天寒地冻", 122);
		所有技能ID.TryAdd("冰冻三尺", 123);
		所有技能ID.TryAdd("极地冰寒", 124);
		所有技能ID.TryAdd("包罗万象", 125);
		所有技能ID.TryAdd("防微杜渐", 131);
		所有技能ID.TryAdd("铁骨铮铮", 132);
		所有技能ID.TryAdd("兵来将挡", 133);
		所有技能ID.TryAdd("铜墙铁壁", 134);
		所有技能ID.TryAdd("天地浑元", 135);
		所有技能ID.TryAdd("火遁术", 152);
		所有技能ID.TryAdd("举火焚天", 161);
		所有技能ID.TryAdd("星火燎原", 162);
		所有技能ID.TryAdd("焰天火雨", 163);
		所有技能ID.TryAdd("焦金砾石", 164);
		所有技能ID.TryAdd("炼狱火海", 165);
		所有技能ID.TryAdd("心醉神迷", 171);
		所有技能ID.TryAdd("神魂颠倒", 172);
		所有技能ID.TryAdd("魂不守舍", 173);
		所有技能ID.TryAdd("魂牵梦萦", 174);
		所有技能ID.TryAdd("魂不附体", 175);
		所有技能ID.TryAdd("十万火急", 181);
		所有技能ID.TryAdd("先声夺人", 182);
		所有技能ID.TryAdd("疾风迅雷", 183);
		所有技能ID.TryAdd("风驰电掣", 184);
		所有技能ID.TryAdd("兵贵神速", 185);
		所有技能ID.TryAdd("土遁术", 202);
		所有技能ID.TryAdd("落土飞岩", 210);
		所有技能ID.TryAdd("土没尘埋", 211);
		所有技能ID.TryAdd("山崩地裂", 212);
		所有技能ID.TryAdd("天塌地陷", 213);
		所有技能ID.TryAdd("石破天惊", 214);
		所有技能ID.TryAdd("有心无力", 221);
		所有技能ID.TryAdd("顾此失彼", 222);
		所有技能ID.TryAdd("六神无主", 223);
		所有技能ID.TryAdd("地束七魄", 224);
		所有技能ID.TryAdd("天定三魂", 225);
		所有技能ID.TryAdd("鞭长莫及", 231);
		所有技能ID.TryAdd("望风扑影", 232);
		所有技能ID.TryAdd("化险为夷", 233);
		所有技能ID.TryAdd("避实就虚", 234);
		所有技能ID.TryAdd("移形换影", 235);
		所有技能ID.TryAdd("翻转乾坤", 252);
		所有技能ID.TryAdd("神圣之光", 253);
		所有技能ID.TryAdd("如意圈", 254);
		所有技能ID.TryAdd("游说之舌", 255);
		所有技能ID.TryAdd("惊妖术", 256);
		所有技能ID.TryAdd("漫天血舞", 257);
		所有技能ID.TryAdd("舍命一击", 258);
		所有技能ID.TryAdd("乾坤罩", 259);
		所有技能ID.TryAdd("神龙罩", 260);
		所有技能ID.TryAdd("死亡缠绵", 261);
		所有技能ID.TryAdd("法力护盾", 262);
		所有技能ID.TryAdd("移花接木", 263);
		所有技能ID.TryAdd("五色光环", 264);
		所有技能ID.TryAdd("舍身取义", 265);
		所有技能ID.TryAdd("人宠合体", 266);
		所有技能ID.TryAdd("解除合体", 267);
		所有技能ID.TryAdd("缥缈虚幻", 268);
		所有技能ID.TryAdd("偷天换日", 269);
		所有技能ID.TryAdd("大道无常", 270);
		所有技能ID.TryAdd("七十二变", 271);
		所有技能ID.TryAdd("仙云迷雾", 272);
		所有技能ID.TryAdd("天旋地转", 273);
		所有技能ID.TryAdd("神圣驱散", 274);
		所有技能ID.TryAdd("法宝共生", 275);
		所有技能ID.TryAdd("查看地图", 301);
		所有技能ID.TryAdd("经营之道", 302);
		所有技能ID.TryAdd("强身术", 303);
		所有技能ID.TryAdd("神体术", 304);
		所有技能ID.TryAdd("修道术", 305);
		所有技能ID.TryAdd("千里眼", 306);
		所有技能ID.TryAdd("玄幻术", 307);
		所有技能ID.TryAdd("腾云驾雾", 308);
		所有技能ID.TryAdd("魔引", 350);
		所有技能ID.TryAdd("狂暴", 351);
		所有技能ID.TryAdd("烈炎", 352);
		所有技能ID.TryAdd("惊雷", 353);
		所有技能ID.TryAdd("青木", 354);
		所有技能ID.TryAdd("碎石", 355);
		所有技能ID.TryAdd("寒冰", 356);
		所有技能ID.TryAdd("怒击", 357);
		所有技能ID.TryAdd("破天", 358);
		所有技能ID.TryAdd("降魔斩", 359);
		所有技能ID.TryAdd("修罗术", 360);
		所有技能ID.TryAdd("反击", 361);
		所有技能ID.TryAdd("云体", 362);
		所有技能ID.TryAdd("仙风", 363);
		所有技能ID.TryAdd("尽忠", 364);
		所有技能ID.TryAdd("金碧辉煌", 401);
		所有技能ID.TryAdd("直捣黄龙", 402);
		所有技能ID.TryAdd("金城汤池", 403);
		所有技能ID.TryAdd("禁法封魂", 404);
		所有技能ID.TryAdd("落叶萧萧", 405);
		所有技能ID.TryAdd("蔓舞飞天", 406);
		所有技能ID.TryAdd("百毒不侵", 407);
		所有技能ID.TryAdd("剧毒攻心", 408);
		所有技能ID.TryAdd("水天一色", 409);
		所有技能ID.TryAdd("铁马冰河", 410);
		所有技能ID.TryAdd("霜甲冰盾", 411);
		所有技能ID.TryAdd("雪飘万里", 412);
		所有技能ID.TryAdd("火树银花", 413);
		所有技能ID.TryAdd("灰飞烟灭", 414);
		所有技能ID.TryAdd("三昧炼心", 415);
		所有技能ID.TryAdd("离火夺魄", 416);
		所有技能ID.TryAdd("飞沙走石", 417);
		所有技能ID.TryAdd("开碑裂石", 418);
		所有技能ID.TryAdd("心如磐石", 419);
		所有技能ID.TryAdd("敌我难分", 420);
		所有技能ID.TryAdd("直取要害", 421);
		所有技能ID.TryAdd("求生本能", 422);
		所有技能ID.TryAdd("识破天机", 423);
		所有技能ID.TryAdd("五雷照顶", 451);
		所有技能ID.TryAdd("枯木逢春", 452);
		所有技能ID.TryAdd("川流不息", 453);
		所有技能ID.TryAdd("道亦有道", 454);
		所有技能ID.TryAdd("捕风捉影", 455);
		所有技能ID.TryAdd("力拔山河", 456);
		所有技能ID.TryAdd("玉露还阳", 457);
		所有技能ID.TryAdd("行云流水", 458);
		所有技能ID.TryAdd("大道无为", 459);
		所有技能ID.TryAdd("天道自然", 460);
		所有技能ID.TryAdd("道法归宗", 461);
		所有技能ID.TryAdd("裂地", 462);
		所有技能ID.TryAdd("销声匿迹", 463);
		所有技能ID.TryAdd("中流砥柱", 464);
		所有技能ID.TryAdd("回生", 465);
		所有技能ID.TryAdd("以己渡人", 466);
		所有技能ID.TryAdd("合力破敌", 467);
		所有技能ID.TryAdd("急速舍身", 468);
		所有技能ID.TryAdd("天道合一", 469);
		所有技能ID.TryAdd("颠倒乾坤", 471);
		所有技能ID.TryAdd("金刚圈", 472);
		所有技能ID.TryAdd("物极必反", 473);
		所有技能ID.TryAdd("天眼", 474);
		所有技能ID.TryAdd("嘲讽", 475);
		所有技能ID.TryAdd("亲密无间", 476);
		所有技能ID.TryAdd("力破千钧", 501);
		所有技能ID.TryAdd("冰魂雪魄", 601);
		所有技能ID.TryAdd("妖皇天怒", 602);
		所有技能ID.TryAdd("天煞狂风", 603);
		所有技能ID.TryAdd("刺血天旋", 604);
		所有技能ID.TryAdd("血炼地狱", 605);
		所有技能ID.TryAdd("道法无边", 606);
		所有技能ID.TryAdd("吞天破月", 607);
		所有技能ID.TryAdd("噬吞乾坤", 608);
		所有技能ID.TryAdd("打狗棒法", 609);
		所有技能ID.TryAdd("狂犬乱咬", 610);
		所有技能ID.TryAdd("玉石俱焚", 611);
		所有技能ID.TryAdd("灵幡驱散", 612);
		所有技能ID.TryAdd("醉酒迷雾", 613);
		所有技能ID.TryAdd("回音之击", 614);
		所有技能ID.TryAdd("法力虚空", 615);
		所有技能ID.TryAdd("天地玄黄", 616);
		所有技能ID.TryAdd("飞尘扬沙", 617);
		所有技能ID.TryAdd("灵魂隔断", 618);
		所有技能ID.TryAdd("天道归一", 619);
		所有技能ID.TryAdd("惊天道术", 620);
		所有技能ID.TryAdd("万象宇化", 621);
		所有技能ID.TryAdd("吞噬灵魂", 622);
		所有技能ID.TryAdd("灵魂吞噬", 624);
		所有技能ID.TryAdd("嗜血狂魔", 625);
		所有技能ID.TryAdd("血脉之力", 626);
		所有技能ID.TryAdd("怨恨加深", 627);
		所有技能ID.TryAdd("魔尊震怒", 628);
		所有技能ID.TryAdd("自毁", 629);
		所有技能ID.TryAdd("相辅相成", 701);
		所有技能ID.TryAdd("坚韧不拔", 702);
		所有技能ID.TryAdd("法力屏障", 703);
		所有技能ID.TryAdd("伤入骨髓", 704);
		所有技能ID.TryAdd("裂魂惊魄", 705);
		所有技能ID.TryAdd("无尽嗜血", 706);
		所有技能ID.TryAdd("天道轮回", 707);
		所有技能ID.TryAdd("黑暗轮回", 708);
		所有技能ID.TryAdd("瘟疫", 801);
		所有技能ID.TryAdd("诅咒", 802);
		所有技能ID.TryAdd("料敌先机", 901);
		所有技能ID.TryAdd("玉露还元", 902);
		所有技能ID.TryAdd("天机神甲", 903);
		所有技能ID.TryAdd("五行相生", 904);
		所有技能ID.TryAdd("药王神鼎", 905);
		所有技能ID.TryAdd("褪灵血咒", 906);
		所有技能ID.TryAdd("灵力增幅", 907);
		所有技能ID.TryAdd("天将下凡", 908);
		所有技能ID.TryAdd("五行相辅", 909);
		所有技能ID.TryAdd("以牙还牙", 910);
		所有技能ID.TryAdd("怒蛟连斩", 911);
		所有技能ID.TryAdd("渴血奇术", 912);
		所有技能ID.TryAdd("共工灭世", 913);
		所有技能ID.TryAdd("后发制人", 914);
		所有技能ID.TryAdd("嗜血狂乱", 915);
		所有技能ID.TryAdd("如幻似梦", 916);
		所有技能ID.TryAdd("三元归一", 917);
		所有技能ID.TryAdd("渡化成空", 918);
		所有技能ID.TryAdd("有仇必报", 919);
		所有技能ID.TryAdd("邪灵附体", 920);
		所有技能ID.TryAdd("金身不灭", 921);
		所有技能ID.TryAdd("金刚之躯", 922);
		所有技能ID.TryAdd("势不可挡", 923);
		所有技能ID.TryAdd("大道轮回", 924);
		所有技能ID.TryAdd("如有神助", 925);
		所有技能ID.TryAdd("法力无边", 926);
		所有技能ID.TryAdd("缓兵之计", 1001);
		所有技能ID.TryAdd("束手就擒", 1002);
		所有技能ID.TryAdd("闻风丧胆", 1003);
		所有技能ID.TryAdd("哀痛欲绝", 1004);
		所有技能ID.TryAdd("养精蓄锐", 1005);
		所有技能ID.TryAdd("助阵", 1101);
		所有技能ID.TryAdd("玄虚灵甲", 1102);
		所有技能ID.TryAdd("玄虚破甲", 1103);
		所有技能ID.TryAdd("念念不忘", 1104);
		所有技能ID.TryAdd("五福化毒", 1105);
		所有技能ID.TryAdd("冻解冰消", 1106);
		所有技能ID.TryAdd("如醉方醒", 1107);
		所有技能ID.TryAdd("拨乱反正", 1108);
		所有技能ID.TryAdd("九天封甲", 1109);
		所有技能ID.TryAdd("忘乎所以", 1110);
		所有技能ID.TryAdd("以毒攻毒", 1111);
		所有技能ID.TryAdd("冰天雪地", 1112);
		所有技能ID.TryAdd("昏昏欲睡", 1113);
		所有技能ID.TryAdd("混沌不分", 1114);
		所有技能ID.TryAdd("九天破甲", 1115);
		所有技能ID.TryAdd("滚鞍堕马", 1116);
		所有技能ID.TryAdd("金戈铁骑", 1117);
		所有技能ID.TryAdd("无所遁形", 1118);
		所有技能ID.TryAdd("遁形隐身", 1119);
		所有技能ID.TryAdd("飞天怒吼", 1120);
		所有技能ID.TryAdd("初生牛犊", 1121);
		所有技能ID.TryAdd("镇定自若", 1122);
		所有技能ID.TryAdd("绝处逢生", 1123);
		所有技能ID.TryAdd("畅通无阻", 1124);
		所有技能ID.TryAdd("敞灵开智", 1125);
		所有技能ID.TryAdd("平心定气", 1126);
		所有技能ID.TryAdd("勾魂夺魄", 1127);
		所有技能ID.TryAdd("岌岌可危", 1128);
		所有技能ID.TryAdd("水泄不通", 1129);
		所有技能ID.TryAdd("封心锁灵", 1130);
		所有技能ID.TryAdd("心荡神迷", 1131);
		所有技能ID.TryAdd("珠联璧合", 1201);
		所有技能ID.TryAdd("雷霆千钧", 1202);
		所有技能ID.TryAdd("采集", 1301);
		所有技能ID.TryAdd("打孔", 1302);
		所有技能ID.TryAdd("镶嵌", 1303);
		所有技能ID.TryAdd("攻击增加", 1401);
		所有技能ID.TryAdd("气血增加", 1402);
		所有技能ID.TryAdd("防御增加", 1403);
		所有技能ID.TryAdd("速度增加", 1404);
		所有技能ID.TryAdd("破龙之击", 1410);
		所有技能ID.TryAdd("千军破敌", 1411);
		所有技能ID.TryAdd("乘胜追击", 1412);
		所有技能ID.TryAdd("生命汲取", 1413);
		所有技能ID.TryAdd("撕裂伤口", 1414);
		所有技能ID.TryAdd("高阶必杀", 1415);
		所有技能ID.TryAdd("高阶连击", 1416);
		所有技能ID.TryAdd("防不胜防", 1417);
		所有技能ID.TryAdd("高阶狂暴", 1418);
		所有技能ID.TryAdd("高阶反击", 1419);
		所有技能ID.TryAdd("多层法术", 1420);
		所有技能ID.TryAdd("一阶反击", 1421);
		所有技能ID.TryAdd("二阶反击", 1422);
		所有技能ID.TryAdd("四阶反击", 1423);
		所有技能ID.TryAdd("忽视抗金", 1424);
		所有技能ID.TryAdd("忽视抗木", 1425);
		所有技能ID.TryAdd("忽视抗水", 1426);
		所有技能ID.TryAdd("忽视抗火", 1427);
		所有技能ID.TryAdd("忽视抗土", 1428);
		所有技能ID.TryAdd("解意之击", 1429);
		所有技能ID.TryAdd("法术汲取", 1430);
		所有技能ID.TryAdd("抵消法必", 1431);
		所有技能ID.TryAdd("抵消混元", 1432);
		所有技能ID.TryAdd("抵消番天", 1433);
		所有技能ID.TryAdd("物理吸收", 1434);
		所有技能ID.TryAdd("法术吸收", 1435);
		所有技能ID.TryAdd("物理免死", 1436);
		所有技能ID.TryAdd("法术免死", 1437);
		所有技能ID.TryAdd("防御加强", 1438);
		所有技能ID.TryAdd("抗性加强", 1439);
		所有技能ID.TryAdd("闪避加强", 1440);
		所有技能ID.TryAdd("高阶防御", 1441);
		所有技能ID.TryAdd("伤害反馈", 1442);
		所有技能ID.TryAdd("气血转化", 1443);
		所有技能ID.TryAdd("天技回生", 1444);
		所有技能ID.TryAdd("辅助回生", 1445);
		所有技能ID.TryAdd("障碍回生", 1446);
		所有技能ID.TryAdd("汲取法力", 1447);
		所有技能ID.TryAdd("法力转化", 1449);
		所有技能ID.TryAdd("天技萃法", 1450);
		所有技能ID.TryAdd("辅助萃法", 1451);
		所有技能ID.TryAdd("障碍萃法", 1452);
		所有技能ID.TryAdd("强力游说", 1453);
		所有技能ID.TryAdd("强力舍命", 1454);
		所有技能ID.TryAdd("强力漫天", 1455);
		所有技能ID.TryAdd("强力翻转", 1456);
		所有技能ID.TryAdd("强力神圣", 1457);
		所有技能ID.TryAdd("高阶游说", 1458);
		所有技能ID.TryAdd("高阶舍命", 1459);
		所有技能ID.TryAdd("高阶漫天", 1460);
		所有技能ID.TryAdd("高阶翻转", 1461);
		所有技能ID.TryAdd("高阶神圣", 1462);
		所有技能ID.TryAdd("阻抗游说", 1463);
		所有技能ID.TryAdd("阻抗舍命", 1464);
		所有技能ID.TryAdd("阻抗漫天", 1465);
		所有技能ID.TryAdd("阻抗翻转", 1466);
		所有技能ID.TryAdd("阻抗神圣", 1467);
		所有技能ID.TryAdd("阻抗遗忘", 1468);
		所有技能ID.TryAdd("阻抗中毒", 1469);
		所有技能ID.TryAdd("阻抗冰冻", 1470);
		所有技能ID.TryAdd("阻抗昏睡", 1471);
		所有技能ID.TryAdd("阻抗混乱", 1472);
		所有技能ID.TryAdd("阻抗镇魂", 1473);
		所有技能ID.TryAdd("阻抗化功", 1474);
		所有技能ID.TryAdd("阻抗水牢", 1475);
		所有技能ID.TryAdd("阻抗锁灵", 1476);
		所有技能ID.TryAdd("阻抗迷心", 1477);
		所有技能ID.TryAdd("高阶速度", 1478);
		所有技能ID.TryAdd("单刀直入", 2011);
		所有技能ID.TryAdd("锐不可挡", 2012);
		所有技能ID.TryAdd("千刀万刃", 2013);
		所有技能ID.TryAdd("锋芒毕露", 2014);
		所有技能ID.TryAdd("万道金光", 2015);
		所有技能ID.TryAdd("不知所措", 2016);
		所有技能ID.TryAdd("胆颤心惊", 2017);
		所有技能ID.TryAdd("惊魂未定", 2018);
		所有技能ID.TryAdd("镇魂锁心", 2019);
		所有技能ID.TryAdd("夺神摄魄", 2020);
		所有技能ID.TryAdd("全力以赴", 2021);
		所有技能ID.TryAdd("气贯长虹", 2022);
		所有技能ID.TryAdd("剑拔弩张", 2023);
		所有技能ID.TryAdd("势如破竹", 2024);
		所有技能ID.TryAdd("力劈玄黄", 2025);
		所有技能ID.TryAdd("花舞叶飞", 2061);
		所有技能ID.TryAdd("扬花飞柳", 2062);
		所有技能ID.TryAdd("秋风扫叶", 2063);
		所有技能ID.TryAdd("一叶菩提", 2064);
		所有技能ID.TryAdd("天女散花", 2065);
		所有技能ID.TryAdd("芒刺在背", 2071);
		所有技能ID.TryAdd("物腐虫生", 2072);
		所有技能ID.TryAdd("毒入骨髓", 2073);
		所有技能ID.TryAdd("九死一生", 2074);
		所有技能ID.TryAdd("遮天蔽日", 2075);
		所有技能ID.TryAdd("甘之如饴", 2081);
		所有技能ID.TryAdd("春风化雨", 2082);
		所有技能ID.TryAdd("润物无声", 2083);
		所有技能ID.TryAdd("醍醐灌顶", 2084);
		所有技能ID.TryAdd("妙手回春", 2085);
		所有技能ID.TryAdd("水流花谢", 2110);
		所有技能ID.TryAdd("积水成渊", 2111);
		所有技能ID.TryAdd("风起水涌", 2112);
		所有技能ID.TryAdd("雪窑冰天", 2113);
		所有技能ID.TryAdd("蛟龙得水", 2114);
		所有技能ID.TryAdd("滴水不漏", 2121);
		所有技能ID.TryAdd("深沟壁垒", 2122);
		所有技能ID.TryAdd("积雪封霜", 2123);
		所有技能ID.TryAdd("日月合璧", 2124);
		所有技能ID.TryAdd("镜花水月", 2125);
		所有技能ID.TryAdd("吐故纳新", 2131);
		所有技能ID.TryAdd("防患未然", 2132);
		所有技能ID.TryAdd("浑然一体", 2133);
		所有技能ID.TryAdd("雨消云散", 2134);
		所有技能ID.TryAdd("水火不侵", 2135);
		所有技能ID.TryAdd("驽箭离弦", 2161);
		所有技能ID.TryAdd("一箭双雕", 2162);
		所有技能ID.TryAdd("箭不虚发", 2163);
		所有技能ID.TryAdd("星飞云散", 2164);
		所有技能ID.TryAdd("万箭穿心", 2165);
		所有技能ID.TryAdd("心锁神封", 2171);
		所有技能ID.TryAdd("重垣迭锁", 2172);
		所有技能ID.TryAdd("如封似闭", 2173);
		所有技能ID.TryAdd("困灵锁心", 2174);
		所有技能ID.TryAdd("云迷雾锁", 2175);
		所有技能ID.TryAdd("急如星火", 2181);
		所有技能ID.TryAdd("星驰电走", 2182);
		所有技能ID.TryAdd("电光石火", 2183);
		所有技能ID.TryAdd("飞云掣电", 2184);
		所有技能ID.TryAdd("虎啸风驰", 2185);
		所有技能ID.TryAdd("土崩瓦解", 2210);
		所有技能ID.TryAdd("尘土飞扬", 2211);
		所有技能ID.TryAdd("扬砾飞沙", 2212);
		所有技能ID.TryAdd("地动山摇", 2213);
		所有技能ID.TryAdd("千岩万壑", 2214);
		所有技能ID.TryAdd("惊惶失措", 2221);
		所有技能ID.TryAdd("染神乱志", 2222);
		所有技能ID.TryAdd("神魂飘荡", 2223);
		所有技能ID.TryAdd("神摇意夺", 2224);
		所有技能ID.TryAdd("惊神破胆", 2225);
		所有技能ID.TryAdd("虚虚实实", 2231);
		所有技能ID.TryAdd("故弄玄虚", 2232);
		所有技能ID.TryAdd("空幻虚实", 2233);
		所有技能ID.TryAdd("虚空幻影", 2234);
		所有技能ID.TryAdd("虚无飘渺", 2235);
		所有技能ID.TryAdd("急急如律令", 9999);
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "金光乍现",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 11,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "刀光剑影",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 12,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "金虹贯日",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 13,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "流光异彩",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 14,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "逆天残刃",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 15,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "流连忘返",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 21,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "得意忘形",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 22,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "如痴如醉",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 23,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "如梦初醒",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 24,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "恍若隔世",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 25,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "天生神力",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 31,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "气冲斗牛",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 32,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "九牛二虎",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 33,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "如虎添翼",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 34,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "力挽狂澜",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 35,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "单刀直入",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 2011,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "锐不可挡",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 2012,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "千刀万刃",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 2013,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "锋芒毕露",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 2014,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "万道金光",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 2015,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "不知所措",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 2016,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "胆颤心惊",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 2017,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "惊魂未定",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 2018,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "镇魂锁心",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 2019,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "夺神摄魄",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 2020,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "全力以赴",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 2021,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "气贯长虹",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 2022,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "剑拔弩张",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 2023,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "势如破竹",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 2024,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "力劈玄黄",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 2025,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "金遁术",
			技能品阶 = AllEnums.技能品阶Type.门派遁术,
			技能id = 2,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "金碧辉煌",
			技能品阶 = AllEnums.技能品阶Type.一阶飞升,
			技能id = 401,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "直捣黄龙",
			技能品阶 = AllEnums.技能品阶Type.二阶飞升,
			技能id = 402,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "金城汤池",
			技能品阶 = AllEnums.技能品阶Type.三阶飞升,
			技能id = 403,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "禁法封魂",
			技能品阶 = AllEnums.技能品阶Type.四阶飞升,
			技能id = 404,
			技能门派 = AllEnums.门派Type.五龙山云霄洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "摘叶飞花",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 61,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "飞柳仙矢",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 62,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "盘根错节",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 63,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "落英缤纷",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 64,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "鬼舞枯藤",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 65,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "见血封喉",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 71,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "蛇口蜂针",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 72,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "鹤顶红粉",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 73,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "蝎尾蛇涎",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 74,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "万蚁噬心",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 75,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "拔苗助长",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 81,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "火上浇油",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 82,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "水涨船高",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 83,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "红花绿叶",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 84,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "锦上添花",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 85,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "花舞叶飞",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 2061,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "扬花飞柳",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 2062,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "秋风扫叶",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 2063,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "一叶菩提",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 2064,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "天女散花",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 2065,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "芒刺在背",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 2071,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "物腐虫生",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 2072,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "毒入骨髓",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 2073,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "九死一生",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 2074,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "遮天蔽日",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 2075,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "甘之如饴",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 2081,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "春风化雨",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 2082,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "润物无声",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 2083,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "醍醐灌顶",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 2084,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "妙手回春",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 2085,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "木遁术",
			技能品阶 = AllEnums.技能品阶Type.门派遁术,
			技能id = 52,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "落叶萧萧",
			技能品阶 = AllEnums.技能品阶Type.一阶飞升,
			技能id = 405,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "蔓舞飞天",
			技能品阶 = AllEnums.技能品阶Type.二阶飞升,
			技能id = 406,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "百毒不侵",
			技能品阶 = AllEnums.技能品阶Type.三阶飞升,
			技能id = 407,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "剧毒攻心",
			技能品阶 = AllEnums.技能品阶Type.四阶飞升,
			技能id = 408,
			技能门派 = AllEnums.门派Type.终南山玉柱洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "滴水穿石",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 110,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "雨恨云愁",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 111,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "悬河泻水",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 112,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "怒波狂涛",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 113,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "搅海翻江",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 114,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "三九严寒",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 121,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "天寒地冻",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 122,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "冰冻三尺",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 123,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "极地冰寒",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 124,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "包罗万象",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 125,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "防微杜渐",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 131,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "铁骨铮铮",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 132,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "兵来将挡",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 133,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "铜墙铁壁",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 134,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "天地浑元",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 135,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "水流花谢",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 2110,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "积水成渊",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 2111,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "风起水涌",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 2112,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "雪窑冰天",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 2113,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "蛟龙得水",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 2114,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "滴水不漏",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 2121,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "深沟壁垒",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 2122,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "积雪封霜",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 2123,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "日月合璧",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 2124,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "镜花水月",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 2125,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "吐故纳新",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 2131,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "防患未然",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 2132,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "浑然一体",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 2133,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "雨消云散",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 2134,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "水火不侵",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 2135,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "水遁术",
			技能品阶 = AllEnums.技能品阶Type.门派遁术,
			技能id = 102,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "水天一色",
			技能品阶 = AllEnums.技能品阶Type.一阶飞升,
			技能id = 409,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "铁马冰河",
			技能品阶 = AllEnums.技能品阶Type.二阶飞升,
			技能id = 410,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "霜甲冰盾",
			技能品阶 = AllEnums.技能品阶Type.三阶飞升,
			技能id = 411,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "雪飘万里",
			技能品阶 = AllEnums.技能品阶Type.四阶飞升,
			技能id = 412,
			技能门派 = AllEnums.门派Type.凤凰山斗阙宫,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "举火焚天",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 161,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "星火燎原",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 162,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "焰天火雨",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 163,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "焦金砾石",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 164,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "炼狱火海",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 165,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "心醉神迷",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 171,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "神魂颠倒",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 172,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "魂不守舍",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 173,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "魂牵梦萦",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 174,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "魂不附体",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 175,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "十万火急",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 181,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "先声夺人",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 182,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "疾风迅雷",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 183,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "风驰电掣",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 184,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "兵贵神速",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 185,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "驽箭离弦",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 2161,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "一箭双雕",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 2162,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "箭不虚发",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 2163,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "星飞云散",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 2164,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "万箭穿心",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 2165,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "心锁神封",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 2171,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "重垣迭锁",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 2172,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "如封似闭",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 2173,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "困灵锁心",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 2174,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "云迷雾锁",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 2175,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "急如星火",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 2181,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "星驰电走",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 2182,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "电光石火",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 2183,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "飞云掣电",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 2184,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "虎啸风驰",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 2185,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "火遁术",
			技能品阶 = AllEnums.技能品阶Type.门派遁术,
			技能id = 152,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "火树银花",
			技能品阶 = AllEnums.技能品阶Type.一阶飞升,
			技能id = 413,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "灰飞烟灭",
			技能品阶 = AllEnums.技能品阶Type.二阶飞升,
			技能id = 414,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "三昧炼心",
			技能品阶 = AllEnums.技能品阶Type.三阶飞升,
			技能id = 415,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "离火夺魄",
			技能品阶 = AllEnums.技能品阶Type.四阶飞升,
			技能id = 416,
			技能门派 = AllEnums.门派Type.乾元山金光洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "落土飞岩",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 210,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "土没尘埋",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 211,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "山崩地裂",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 212,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "天塌地陷",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 213,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "石破天惊",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 214,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "有心无力",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 221,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "顾此失彼",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 222,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "六神无主",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 223,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "地束七魄",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 224,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "天定三魂",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 225,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "鞭长莫及",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 231,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "望风扑影",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 232,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "化险为夷",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 233,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "避实就虚",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 234,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "移形换影",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 235,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 1
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "土崩瓦解",
			技能品阶 = AllEnums.技能品阶Type.一阶攻击,
			技能id = 2210,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "尘土飞扬",
			技能品阶 = AllEnums.技能品阶Type.二阶攻击,
			技能id = 2211,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "扬砾飞沙",
			技能品阶 = AllEnums.技能品阶Type.三阶攻击,
			技能id = 2212,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "地动山摇",
			技能品阶 = AllEnums.技能品阶Type.四阶攻击,
			技能id = 2213,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "千岩万壑",
			技能品阶 = AllEnums.技能品阶Type.五阶攻击,
			技能id = 2214,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "惊惶失措",
			技能品阶 = AllEnums.技能品阶Type.一阶障碍,
			技能id = 2221,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "染神乱志",
			技能品阶 = AllEnums.技能品阶Type.二阶障碍,
			技能id = 2222,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "神魂飘荡",
			技能品阶 = AllEnums.技能品阶Type.三阶障碍,
			技能id = 2223,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "神摇意夺",
			技能品阶 = AllEnums.技能品阶Type.四阶障碍,
			技能id = 2224,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "惊神破胆",
			技能品阶 = AllEnums.技能品阶Type.五阶障碍,
			技能id = 2225,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "虚虚实实",
			技能品阶 = AllEnums.技能品阶Type.一阶辅助,
			技能id = 2231,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "故弄玄虚",
			技能品阶 = AllEnums.技能品阶Type.二阶辅助,
			技能id = 2232,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "空幻虚实",
			技能品阶 = AllEnums.技能品阶Type.三阶辅助,
			技能id = 2233,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "虚空幻影",
			技能品阶 = AllEnums.技能品阶Type.四阶辅助,
			技能id = 2234,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "虚无飘渺",
			技能品阶 = AllEnums.技能品阶Type.五阶辅助,
			技能id = 2235,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 2
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "土遁术",
			技能品阶 = AllEnums.技能品阶Type.门派遁术,
			技能id = 202,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "飞沙走石",
			技能品阶 = AllEnums.技能品阶Type.一阶飞升,
			技能id = 417,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "开碑裂石",
			技能品阶 = AllEnums.技能品阶Type.二阶飞升,
			技能id = 418,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "心如磐石",
			技能品阶 = AllEnums.技能品阶Type.三阶飞升,
			技能id = 419,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 0
		});
		技能详细数据.Add(new 技能详细数据类
		{
			技能名字 = "敌我难分",
			技能品阶 = AllEnums.技能品阶Type.四阶飞升,
			技能id = 420,
			技能门派 = AllEnums.门派Type.骷髅山白骨洞,
			技能类型 = 0
		});
		所有等级首饰转属次数.TryAdd(11, new List<int> { 2, 0 });
		所有等级首饰转属次数.TryAdd(12, new List<int> { 3, 2, 0 });
		所有等级首饰转属次数.TryAdd(13, new List<int> { 7, 3, 2, 0 });
		所有等级首饰转属次数.TryAdd(14, new List<int> { 15, 7, 3, 1, 0 });
		所有等级首饰转属次数.TryAdd(15, new List<int> { 31, 15, 7, 3, 1, 0 });
		所有等级首饰转属次数.TryAdd(16, new List<int> { 63, 31, 15, 7, 3, 1, 0 });
		所有等级首饰转属次数.TryAdd(17, new List<int> { 127, 63, 31, 15, 7, 3, 1, 0 });
		所有等级首饰转属次数.TryAdd(18, new List<int> { 255, 63, 31, 15, 7, 3, 1, 0 });
		所有坐姿对应动作.TryAdd("740011", value: false);
		所有坐姿对应动作.TryAdd("740012", value: false);
		所有坐姿对应动作.TryAdd("740013", value: false);
		所有坐姿对应动作.TryAdd("740014", value: false);
		所有坐姿对应动作.TryAdd("740015", value: false);
		所有坐姿对应动作.TryAdd("740021", value: true);
		所有坐姿对应动作.TryAdd("740022", value: true);
		所有坐姿对应动作.TryAdd("740023", value: true);
		所有坐姿对应动作.TryAdd("740024", value: true);
		所有坐姿对应动作.TryAdd("740025", value: true);
		所有坐姿对应动作.TryAdd("740031", value: true);
		所有坐姿对应动作.TryAdd("740032", value: true);
		所有坐姿对应动作.TryAdd("740033", value: true);
		所有坐姿对应动作.TryAdd("740034", value: true);
		所有坐姿对应动作.TryAdd("740035", value: true);
		所有坐姿对应动作.TryAdd("750011", value: false);
		所有坐姿对应动作.TryAdd("750012", value: false);
		所有坐姿对应动作.TryAdd("750013", value: false);
		所有坐姿对应动作.TryAdd("750014", value: false);
		所有坐姿对应动作.TryAdd("750015", value: false);
		所有坐姿对应动作.TryAdd("750021", value: true);
		所有坐姿对应动作.TryAdd("750022", value: true);
		所有坐姿对应动作.TryAdd("750023", value: true);
		所有坐姿对应动作.TryAdd("750024", value: true);
		所有坐姿对应动作.TryAdd("750025", value: true);
		所有坐姿对应动作.TryAdd("760011", value: false);
		所有坐姿对应动作.TryAdd("760012", value: false);
		所有坐姿对应动作.TryAdd("760013", value: false);
		所有坐姿对应动作.TryAdd("760014", value: false);
		所有坐姿对应动作.TryAdd("760015", value: false);
		所有坐姿对应动作.TryAdd("760021", value: true);
		所有坐姿对应动作.TryAdd("760022", value: true);
		所有坐姿对应动作.TryAdd("760023", value: true);
		所有坐姿对应动作.TryAdd("760024", value: true);
		所有坐姿对应动作.TryAdd("760025", value: true);
		所有坐姿对应动作.TryAdd("760031", value: true);
		所有坐姿对应动作.TryAdd("770032", value: true);
		所有坐姿对应动作.TryAdd("770033", value: true);
		所有坐姿对应动作.TryAdd("760034", value: true);
		所有坐姿对应动作.TryAdd("760035", value: true);
		所有坐姿对应动作.TryAdd("770011", value: false);
		所有坐姿对应动作.TryAdd("770012", value: false);
		所有坐姿对应动作.TryAdd("770013", value: false);
		所有坐姿对应动作.TryAdd("770014", value: false);
		所有坐姿对应动作.TryAdd("770015", value: false);
		所有坐姿对应动作.TryAdd("770021", value: true);
		所有坐姿对应动作.TryAdd("770022", value: true);
		所有坐姿对应动作.TryAdd("770023", value: true);
		所有坐姿对应动作.TryAdd("770024", value: true);
		所有坐姿对应动作.TryAdd("770025", value: true);
	}

	public static string GetIcons(int 门派, int 新旧, int 性别)
	{
		string result = "";
		if (门派 == 1 && 新旧 == 1 && 性别 == 1)
		{
			result = "6001";
		}
		else if (门派 == 1 && 新旧 == 2 && 性别 == 1)
		{
			result = "4001";
		}
		else if (门派 == 1 && 新旧 == 1 && 性别 == 2)
		{
			result = "7001";
		}
		else if (门派 == 1 && 新旧 == 2 && 性别 == 2)
		{
			result = "5001";
		}
		else if (门派 == 2 && 新旧 == 1 && 性别 == 1)
		{
			result = "7002";
		}
		else if (门派 == 2 && 新旧 == 2 && 性别 == 1)
		{
			result = "4002";
		}
		else if (门派 == 2 && 新旧 == 1 && 性别 == 2)
		{
			result = "6002";
		}
		else if (门派 == 2 && 新旧 == 2 && 性别 == 2)
		{
			result = "5002";
		}
		else if (门派 == 3 && 新旧 == 1 && 性别 == 1)
		{
			result = "7003";
		}
		else if (门派 == 3 && 新旧 == 2 && 性别 == 1)
		{
			result = "4003";
		}
		else if (门派 == 3 && 新旧 == 1 && 性别 == 2)
		{
			result = "6003";
		}
		else if (门派 == 3 && 新旧 == 2 && 性别 == 2)
		{
			result = "5003";
		}
		else if (门派 == 4 && 新旧 == 1 && 性别 == 1)
		{
			result = "6004";
		}
		else if (门派 == 4 && 新旧 == 2 && 性别 == 1)
		{
			result = "4004";
		}
		else if (门派 == 4 && 新旧 == 1 && 性别 == 2)
		{
			result = "7004";
		}
		else if (门派 == 4 && 新旧 == 2 && 性别 == 2)
		{
			result = "5004";
		}
		else if (门派 == 5 && 新旧 == 1 && 性别 == 1)
		{
			result = "6005";
		}
		else if (门派 == 5 && 新旧 == 2 && 性别 == 1)
		{
			result = "4005";
		}
		else if (门派 == 5 && 新旧 == 1 && 性别 == 2)
		{
			result = "7005";
		}
		else if (门派 == 5 && 新旧 == 2 && 性别 == 2)
		{
			result = "5005";
		}
		return result;
	}

	public static string GetTimeChuo(bool bflag)
	{
		TimeSpan timeSpan = DateTime.UtcNow - new DateTime(1970, 1, 1, 0, 0, 0, 0);
		string empty = string.Empty;
		if (bflag)
		{
			return Convert.ToInt64(timeSpan.TotalSeconds).ToString();
		}
		return Convert.ToInt64(timeSpan.TotalMilliseconds).ToString();
	}

	public static string GetStringRe(string value, string type, string[] infos)
	{
		string[] array = value.Split(new string[1] { type }, StringSplitOptions.None);
		string text = "";
		for (int i = 0; i < array.Length; i++)
		{
			if (i + 1 == array.Length)
			{
				text += array[i];
				break;
			}
			text = text + array[i] + infos[i];
		}
		return text;
	}

	public static string Get属性颜色(AllEnums.属性类别 类别)
	{
		return 类别 switch
		{
			AllEnums.属性类别.prop => "#B", 
			AllEnums.属性类别.prop2 => "#O", 
			AllEnums.属性类别.prop4 => "#Y", 
			AllEnums.属性类别.prop3 => "#G", 
			AllEnums.属性类别.prop_suit => "#B", 
			AllEnums.属性类别.prop_seal_base => "#L", 
			AllEnums.属性类别.prop_seal => "#L", 
			AllEnums.属性类别.prop_rebuild => "#B", 
			AllEnums.属性类别.prop_resonance => "#B", 
			_ => "#n", 
		};
	}

	public static bool Get道具类型(int 装备类型, bool Is校验装备 = true, bool Is校验首饰 = true)
	{
		if (Is校验装备 && (装备类型 == 1 || 装备类型 == 2 || 装备类型 == 3 || 装备类型 == 7 || 装备类型 == 10))
		{
			return true;
		}
		if (Is校验首饰 && (装备类型 == 4 || 装备类型 == 5 || 装备类型 == 6))
		{
			return true;
		}
		return false;
	}

	public static string Add属性名字后缀(AllEnums.属性名字Type 属性名字)
	{
		return 属性名字 switch
		{
			AllEnums.属性名字Type.物理攻击效果 => "%", 
			AllEnums.属性名字Type.法术攻击效果 => "%", 
			AllEnums.属性名字Type.抗物理 => "%", 
			AllEnums.属性名字Type.抗法术 => "%", 
			AllEnums.属性名字Type.金抗性 => "%", 
			AllEnums.属性名字Type.木抗性 => "%", 
			AllEnums.属性名字Type.水抗性 => "%", 
			AllEnums.属性名字Type.火抗性 => "%", 
			AllEnums.属性名字Type.土抗性 => "%", 
			AllEnums.属性名字Type.抗中毒 => "%", 
			AllEnums.属性名字Type.抗冰冻 => "%", 
			AllEnums.属性名字Type.抗昏睡 => "%", 
			AllEnums.属性名字Type.抗遗忘 => "%", 
			AllEnums.属性名字Type.抗混乱 => "%", 
			AllEnums.属性名字Type.抗所有异常 => "%", 
			AllEnums.属性名字Type.破防率 => "%", 
			AllEnums.属性名字Type.连击率 => "%", 
			AllEnums.属性名字Type.反击率 => "%", 
			AllEnums.属性名字Type.反震率 => "%", 
			AllEnums.属性名字Type.躲闪率 => "%", 
			AllEnums.属性名字Type.物理必杀率 => "%", 
			AllEnums.属性名字Type.攻击效果 => "%", 
			AllEnums.属性名字Type.所有抗性 => "%", 
			AllEnums.属性名字Type.忽视目标抗金 => "%", 
			AllEnums.属性名字Type.忽视目标抗木 => "%", 
			AllEnums.属性名字Type.忽视目标抗水 => "%", 
			AllEnums.属性名字Type.忽视目标抗火 => "%", 
			AllEnums.属性名字Type.忽视目标抗土 => "%", 
			AllEnums.属性名字Type.忽视目标抗遗忘 => "%", 
			AllEnums.属性名字Type.忽视目标抗中毒 => "%", 
			AllEnums.属性名字Type.忽视目标抗冰冻 => "%", 
			AllEnums.属性名字Type.忽视目标抗昏睡 => "%", 
			AllEnums.属性名字Type.忽视目标抗混乱 => "%", 
			AllEnums.属性名字Type.强力克金 => "%", 
			AllEnums.属性名字Type.强力克木 => "%", 
			AllEnums.属性名字Type.强力克水 => "%", 
			AllEnums.属性名字Type.强力克火 => "%", 
			AllEnums.属性名字Type.强力克土 => "%", 
			AllEnums.属性名字Type.金光乍现反击率 => "%", 
			AllEnums.属性名字Type.摘叶飞花反击率 => "%", 
			AllEnums.属性名字Type.滴水穿石反击率 => "%", 
			AllEnums.属性名字Type.举火焚天反击率 => "%", 
			AllEnums.属性名字Type.落土飞岩反击率 => "%", 
			AllEnums.属性名字Type.强金法伤害 => "%", 
			AllEnums.属性名字Type.强木法伤害 => "%", 
			AllEnums.属性名字Type.强水法伤害 => "%", 
			AllEnums.属性名字Type.强火法伤害 => "%", 
			AllEnums.属性名字Type.强土法伤害 => "%", 
			AllEnums.属性名字Type.强物理伤害 => "%", 
			AllEnums.属性名字Type.躲避攻击 => "%", 
			AllEnums.属性名字Type.师门攻击技能消耗降低 => "%", 
			AllEnums.属性名字Type.师门障碍技能消耗降低 => "%", 
			AllEnums.属性名字Type.师门辅助技能消耗降低 => "%", 
			AllEnums.属性名字Type.强力中毒 => "%", 
			AllEnums.属性名字Type.强力昏睡 => "%", 
			AllEnums.属性名字Type.强力冰冻 => "%", 
			AllEnums.属性名字Type.强力遗忘 => "%", 
			AllEnums.属性名字Type.强力混乱 => "%", 
			AllEnums.属性名字Type.金系法攻 => "%", 
			AllEnums.属性名字Type.木系法攻 => "%", 
			AllEnums.属性名字Type.水系法攻 => "%", 
			AllEnums.属性名字Type.火系法攻 => "%", 
			AllEnums.属性名字Type.土系法攻 => "%", 
			AllEnums.属性名字Type.忽视目标抗物理 => "%", 
			AllEnums.属性名字Type.忽视所有抗性 => "%", 
			AllEnums.属性名字Type.忽视所有抗异常 => "%", 
			AllEnums.属性名字Type.解除遗忘状态 => "%", 
			AllEnums.属性名字Type.解除中毒状态 => "%", 
			AllEnums.属性名字Type.解除冰冻状态 => "%", 
			AllEnums.属性名字Type.解除昏睡状态 => "%", 
			AllEnums.属性名字Type.解除混乱状态 => "%", 
			AllEnums.属性名字Type.忽视目标连击 => "%", 
			AllEnums.属性名字Type.忽视目标物理必杀 => "%", 
			AllEnums.属性名字Type.追击率 => "%", 
			AllEnums.属性名字Type.强力障碍宠物 => "%", 
			AllEnums.属性名字Type.忽视躲避攻击 => "%", 
			AllEnums.属性名字Type.法术必杀率 => "%", 
			AllEnums.属性名字Type.忽视目标法术必杀 => "%", 
			AllEnums.属性名字Type.抗神圣之光 => "%", 
			AllEnums.属性名字Type.抗游说之舌 => "%", 
			AllEnums.属性名字Type.抗舍命一击 => "%", 
			AllEnums.属性名字Type.抗翻转乾坤 => "%", 
			AllEnums.属性名字Type.抗漫天血舞 => "%", 
			AllEnums.属性名字Type.抗镇魂 => "%", 
			AllEnums.属性名字Type.抗化功 => "%", 
			AllEnums.属性名字Type.抗水牢 => "%", 
			AllEnums.属性名字Type.抗锁灵 => "%", 
			AllEnums.属性名字Type.抗迷心 => "%", 
			AllEnums.属性名字Type.忽视目标抗镇魂 => "%", 
			AllEnums.属性名字Type.忽视目标抗化功 => "%", 
			AllEnums.属性名字Type.忽视目标抗水牢 => "%", 
			AllEnums.属性名字Type.忽视目标抗锁灵 => "%", 
			AllEnums.属性名字Type.忽视目标抗迷心 => "%", 
			AllEnums.属性名字Type.解除镇魂状态 => "%", 
			AllEnums.属性名字Type.解除化功状态 => "%", 
			AllEnums.属性名字Type.解除水牢状态 => "%", 
			AllEnums.属性名字Type.解除锁灵状态 => "%", 
			AllEnums.属性名字Type.解除迷心状态 => "%", 
			AllEnums.属性名字Type.强力镇魂 => "%", 
			AllEnums.属性名字Type.强力化功 => "%", 
			AllEnums.属性名字Type.强力水牢 => "%", 
			AllEnums.属性名字Type.强力锁灵 => "%", 
			AllEnums.属性名字Type.强力迷心 => "%", 
			_ => string.Empty, 
		};
	}
}
