using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Runtime.CompilerServices;
using Newtonsoft_X.Json;
using Serilog;
using vEAdPGPTkDFOYsbi303;

namespace hUWm54DrC1dskj6PIsS;

internal class QxBx5YDqZUOBMg9A6NN : Singleton<QxBx5YDqZUOBMg9A6NN>
{
	[CompilerGenerated]
	private sealed class _003C_003Ec__DisplayClass7_0
	{
		public int l0wMuCvMy3;

		
		public _003C_003Ec__DisplayClass7_0()
		{
		}

		
		internal bool ow45zpgIhw(int x)
		{
			return x == l0wMuCvMy3;
		}

		static _003C_003Ec__DisplayClass7_0()
		{
		}
	}

	[CompilerGenerated]
	private sealed class _003C_003Ec__DisplayClass8_0
	{
		public MyNATSocketClient MJcMbir44e;

		public int DnRMJ4BTiS;

		public bool zLBMKy0hKm;

		public bool sEYMR3xwdk;

		public int ugPMd43JWm;

		
		public _003C_003Ec__DisplayClass8_0()
		{
		}

		
		internal void NCnMwp5yvC(int v)
		{
			if (v > 0)
			{
				if (v != DnRMJ4BTiS)
				{
					return;
				}
				zLBMKy0hKm = true;
			}
			else if (v == -1)
			{
				sEYMR3xwdk = true;
			}
			if (!zLBMKy0hKm || !sEYMR3xwdk)
			{
				return;
			}
			MJcMbir44e.超级进化事件 = null;
			List<属性数据> list = MJcMbir44e.user.背包数据.物品列表[DnRMJ4BTiS].装备属性列表.FindAll( (属性数据 x) => x.属性类别 == 514 || x.属性类别 == 770 || x.属性类别 == 3074);
			List<string[]> list2 = new List<string[]>();
			DefaultInterpolatedStringHandler defaultInterpolatedStringHandler;
			using (List<属性数据>.Enumerator enumerator = list.GetEnumerator())
			{
				while (enumerator.MoveNext())
				{
					_003C_003Ec__DisplayClass8_1 CS_0024_003C_003E8__locals8 = new _003C_003Ec__DisplayClass8_1();
					CS_0024_003C_003E8__locals8.gdFMW2auXM = this;
					CS_0024_003C_003E8__locals8.mHRMUgFHlK = enumerator.Current;
					if (问道数据类.属性名字字典.Contains(CS_0024_003C_003E8__locals8.mHRMUgFHlK.属性标识))
					{
						超级进化列表类 超级进化列表类2 = Singleton<全局变量类>.I.超级进化配置.属性列表.Find( (超级进化列表类 x) => x.是否启用 && x.属性名字 == (AllEnums.属性名字Type)CS_0024_003C_003E8__locals8.mHRMUgFHlK.属性标识 && x.Is可进化(CS_0024_003C_003E8__locals8.gdFMW2auXM.ugPMd43JWm, CS_0024_003C_003E8__locals8.mHRMUgFHlK.属性数值));
						if (超级进化列表类2 != null)
						{
							string[] array = new string[2];
							defaultInterpolatedStringHandler = new DefaultInterpolatedStringHandler(1, 2);
							defaultInterpolatedStringHandler.AppendFormatted((AllEnums.属性类别)CS_0024_003C_003E8__locals8.mHRMUgFHlK.属性类别);
							defaultInterpolatedStringHandler.AppendLiteral("/");
							defaultInterpolatedStringHandler.AppendFormatted((AllEnums.属性标识Type)CS_0024_003C_003E8__locals8.mHRMUgFHlK.属性标识);
							array[0] = defaultInterpolatedStringHandler.ToStringAndClear();
							array[1] = $"{超级进化列表类2.Is取数值(ugPMd43JWm)}";
							list2.Add(array);
						}
					}
				}
			}
			if (list2.Count <= 0)
			{
				return;
			}
			Singleton<WdAPI>.I.NNfIVUuyWv(MJcMbir44e, DnRMJ4BTiS, list2);
			MyNATSocketClient myNATSocketClient = MJcMbir44e;
			WdAPI i = Singleton<WdAPI>.I;
			defaultInterpolatedStringHandler = new DefaultInterpolatedStringHandler(62, 2);
			defaultInterpolatedStringHandler.AppendLiteral("你的#Y");
			defaultInterpolatedStringHandler.AppendFormatted(MJcMbir44e.user.背包数据.物品列表[DnRMJ4BTiS].名字);
			defaultInterpolatedStringHandler.AppendLiteral("#n在进化到#R");
			defaultInterpolatedStringHandler.AppendFormatted(ugPMd43JWm);
			defaultInterpolatedStringHandler.AppendLiteral("#n级时触发了#G超进化#n机制，#B蓝#n、#O粉#n、#Y黄#n属性提升到了当前等级的完美数值。");
			myNATSocketClient.C_Send(i.提示_提醒和杂项公告(defaultInterpolatedStringHandler.ToStringAndClear()));
			if (Singleton<全局变量类>.I.超级进化配置.谣言开关)
			{
				Action<byte[]> client频道事件 = Singleton<全局变量类>.I.Client频道事件;
				if (client频道事件 != null)
				{
					WdAPI i2 = Singleton<WdAPI>.I;
					defaultInterpolatedStringHandler = new DefaultInterpolatedStringHandler(64, 2);
					defaultInterpolatedStringHandler.AppendLiteral("#26天呐，#Y");
					defaultInterpolatedStringHandler.AppendFormatted(MJcMbir44e.user.人物数据.昵称);
					defaultInterpolatedStringHandler.AppendLiteral("#n的#Y");
					defaultInterpolatedStringHandler.AppendFormatted(MJcMbir44e.user.背包数据.物品列表[DnRMJ4BTiS].名字);
					defaultInterpolatedStringHandler.AppendLiteral("#n进化时触发了#G超进化#n机制，#B蓝#n、#O粉#n、#Y黄#n属性提升到了当前等级的完美数值。");
					client频道事件(i2.组包聊天信息(defaultInterpolatedStringHandler.ToStringAndClear(), "管理员"));
				}
			}
			MJcMbir44e.S_Send(new byte[23]
			{
				77, 90, 0, 0, 0, 0, 0, 0, 0, 13,
				65, 38, 0, 0, 0, 1, 0, 71, 1, 0,
				0, 0, 0
			}, "超级进化事件处理");
		}

		static _003C_003Ec__DisplayClass8_0()
		{
		}
	}

	[CompilerGenerated]
	private sealed class _003C_003Ec__DisplayClass8_1
	{
		public 属性数据 mHRMUgFHlK;

		public _003C_003Ec__DisplayClass8_0 gdFMW2auXM;

		
		public _003C_003Ec__DisplayClass8_1()
		{
		}

		
		internal bool QKqMsdmcs9(超级进化列表类 x)
		{
			if (x.是否启用 && x.属性名字 == (AllEnums.属性名字Type)mHRMUgFHlK.属性标识)
			{
				return x.Is可进化(gdFMW2auXM.ugPMd43JWm, mHRMUgFHlK.属性数值);
			}
			return false;
		}

		static _003C_003Ec__DisplayClass8_1()
		{
		}
	}

	private static int[] smHjJ5ZG8W;

	
	[SpecialName]
	internal static bool WFbjwFZLly()
	{
		if (全局变量类.Is调试 || Singleton<全局变量类>.I.验证client.授权配置.Is超进化)
		{
			return Singleton<全局变量类>.I.超级进化配置.功能开关;
		}
		return false;
	}

	
	internal void SueDZGCGlv()
	{
		try
		{
			if (File.Exists(mEdebOPadFyb5ykL5Wy.W80P9ipOVU("超级进化配置类.json")))
			{
				Singleton<全局变量类>.I.超级进化配置 = JsonConvert.DeserializeObject<超级进化配置类>(File.ReadAllText(mEdebOPadFyb5ykL5Wy.W80P9ipOVU("超级进化配置类.json")));
				return;
			}
			Singleton<全局变量类>.I.超级进化配置 = new 超级进化配置类();
			Singleton<全局变量类>.I.超级进化配置.功能开关 = false;
			Singleton<全局变量类>.I.超级进化配置.谣言开关 = false;
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.物理伤害,
				进化数值89 = 2000,
				进化数值90 = 2000,
				进化数值99 = 2400,
				进化数值100 = 2400,
				进化数值109 = 2800,
				进化数值110 = 2800,
				进化数值119 = 3200,
				进化数值120 = 3200,
				进化数值129 = 3600,
				进化数值130 = 3800,
				进化数值139 = 4200,
				进化数值140 = 4200,
				进化数值149 = 4800,
				进化数值150 = 4800,
				进化数值159 = 5400,
				进化数值160 = 5400,
				进化数值169 = 6000,
				进化数值170 = 6200,
				进化数值179 = 6600,
				进化数值180 = 6800,
				进化数值189 = 7200,
				进化数值190 = 7400,
				进化数值199 = 7800
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.法术伤害,
				进化数值89 = 2000,
				进化数值90 = 2000,
				进化数值99 = 2400,
				进化数值100 = 2400,
				进化数值109 = 2800,
				进化数值110 = 2800,
				进化数值119 = 3200,
				进化数值120 = 3200,
				进化数值129 = 3600,
				进化数值130 = 3800,
				进化数值139 = 4200,
				进化数值140 = 4200,
				进化数值149 = 4800,
				进化数值150 = 4800,
				进化数值159 = 5400,
				进化数值160 = 5400,
				进化数值169 = 6000,
				进化数值170 = 6200,
				进化数值179 = 6600,
				进化数值180 = 6800,
				进化数值189 = 7200,
				进化数值190 = 7400,
				进化数值199 = 7800
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.气血,
				进化数值89 = 1600,
				进化数值90 = 1600,
				进化数值99 = 1900,
				进化数值100 = 2400,
				进化数值109 = 2800,
				进化数值110 = 3200,
				进化数值119 = 3800,
				进化数值120 = 4600,
				进化数值129 = 5000,
				进化数值130 = 6000,
				进化数值139 = 6500,
				进化数值140 = 6500,
				进化数值149 = 7500,
				进化数值150 = 9000,
				进化数值159 = 10000,
				进化数值160 = 10000,
				进化数值169 = 13000,
				进化数值170 = 14000,
				进化数值179 = 18000,
				进化数值180 = 20000,
				进化数值189 = 28000,
				进化数值190 = 30000,
				进化数值199 = 40000
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.法力,
				进化数值89 = 1600,
				进化数值90 = 1600,
				进化数值99 = 1900,
				进化数值100 = 2400,
				进化数值109 = 2800,
				进化数值110 = 3200,
				进化数值119 = 3800,
				进化数值120 = 4600,
				进化数值129 = 5000,
				进化数值130 = 6000,
				进化数值139 = 6500,
				进化数值140 = 6500,
				进化数值149 = 7500,
				进化数值150 = 9000,
				进化数值159 = 10000,
				进化数值160 = 10000,
				进化数值169 = 13000,
				进化数值170 = 14000,
				进化数值179 = 18000,
				进化数值180 = 20000,
				进化数值189 = 28000,
				进化数值190 = 30000,
				进化数值199 = 40000
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.防御,
				进化数值89 = 550,
				进化数值90 = 550,
				进化数值99 = 650,
				进化数值100 = 850,
				进化数值109 = 1000,
				进化数值110 = 1200,
				进化数值119 = 1300,
				进化数值120 = 1500,
				进化数值129 = 1800,
				进化数值130 = 2000,
				进化数值139 = 2400,
				进化数值140 = 2400,
				进化数值149 = 2600,
				进化数值150 = 3200,
				进化数值159 = 3600,
				进化数值160 = 3600,
				进化数值169 = 4000,
				进化数值170 = 4200,
				进化数值179 = 4600,
				进化数值180 = 4800,
				进化数值189 = 5200,
				进化数值190 = 5400,
				进化数值199 = 6000
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.速度,
				进化数值89 = 110,
				进化数值90 = 120,
				进化数值99 = 130,
				进化数值100 = 130,
				进化数值109 = 140,
				进化数值110 = 140,
				进化数值119 = 150,
				进化数值120 = 160,
				进化数值129 = 170,
				进化数值130 = 170,
				进化数值139 = 180,
				进化数值140 = 180,
				进化数值149 = 190,
				进化数值150 = 190,
				进化数值159 = 200,
				进化数值160 = 200,
				进化数值169 = 220,
				进化数值170 = 240,
				进化数值179 = 260,
				进化数值180 = 280,
				进化数值189 = 300,
				进化数值190 = 320,
				进化数值199 = 340
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.力量,
				进化数值89 = 22,
				进化数值90 = 22,
				进化数值99 = 24,
				进化数值100 = 25,
				进化数值109 = 27,
				进化数值110 = 27,
				进化数值119 = 29,
				进化数值120 = 30,
				进化数值129 = 32,
				进化数值130 = 32,
				进化数值139 = 34,
				进化数值140 = 34,
				进化数值149 = 36,
				进化数值150 = 36,
				进化数值159 = 38,
				进化数值160 = 38,
				进化数值169 = 41,
				进化数值170 = 42,
				进化数值179 = 44,
				进化数值180 = 46,
				进化数值189 = 48,
				进化数值190 = 50,
				进化数值199 = 52
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.灵力,
				进化数值89 = 22,
				进化数值90 = 22,
				进化数值99 = 24,
				进化数值100 = 25,
				进化数值109 = 27,
				进化数值110 = 27,
				进化数值119 = 29,
				进化数值120 = 30,
				进化数值129 = 32,
				进化数值130 = 32,
				进化数值139 = 34,
				进化数值140 = 34,
				进化数值149 = 36,
				进化数值150 = 36,
				进化数值159 = 38,
				进化数值160 = 38,
				进化数值169 = 41,
				进化数值170 = 42,
				进化数值179 = 44,
				进化数值180 = 46,
				进化数值189 = 48,
				进化数值190 = 50,
				进化数值199 = 52
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.体质,
				进化数值89 = 22,
				进化数值90 = 22,
				进化数值99 = 24,
				进化数值100 = 25,
				进化数值109 = 27,
				进化数值110 = 27,
				进化数值119 = 29,
				进化数值120 = 30,
				进化数值129 = 32,
				进化数值130 = 32,
				进化数值139 = 34,
				进化数值140 = 34,
				进化数值149 = 36,
				进化数值150 = 36,
				进化数值159 = 38,
				进化数值160 = 38,
				进化数值169 = 41,
				进化数值170 = 42,
				进化数值179 = 44,
				进化数值180 = 46,
				进化数值189 = 48,
				进化数值190 = 50,
				进化数值199 = 52
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.敏捷,
				进化数值89 = 22,
				进化数值90 = 22,
				进化数值99 = 24,
				进化数值100 = 25,
				进化数值109 = 27,
				进化数值110 = 27,
				进化数值119 = 29,
				进化数值120 = 30,
				进化数值129 = 32,
				进化数值130 = 32,
				进化数值139 = 34,
				进化数值140 = 34,
				进化数值149 = 36,
				进化数值150 = 36,
				进化数值159 = 38,
				进化数值160 = 38,
				进化数值169 = 41,
				进化数值170 = 42,
				进化数值179 = 44,
				进化数值180 = 46,
				进化数值189 = 48,
				进化数值190 = 50,
				进化数值199 = 52
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.所有属性,
				进化数值89 = 17,
				进化数值90 = 18,
				进化数值99 = 19,
				进化数值100 = 20,
				进化数值109 = 21,
				进化数值110 = 22,
				进化数值119 = 23,
				进化数值120 = 24,
				进化数值129 = 25,
				进化数值130 = 26,
				进化数值139 = 27,
				进化数值140 = 27,
				进化数值149 = 29,
				进化数值150 = 29,
				进化数值159 = 30,
				进化数值160 = 31,
				进化数值169 = 32,
				进化数值170 = 33,
				进化数值179 = 34,
				进化数值180 = 36,
				进化数值189 = 38,
				进化数值190 = 40,
				进化数值199 = 42
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.金相性,
				进化数值89 = 5,
				进化数值90 = 5,
				进化数值99 = 5,
				进化数值100 = 5,
				进化数值109 = 5,
				进化数值110 = 5,
				进化数值119 = 5,
				进化数值120 = 5,
				进化数值129 = 5,
				进化数值130 = 5,
				进化数值139 = 5,
				进化数值140 = 5,
				进化数值149 = 5,
				进化数值150 = 5,
				进化数值159 = 5,
				进化数值160 = 5,
				进化数值169 = 5,
				进化数值170 = 5,
				进化数值179 = 5,
				进化数值180 = 5,
				进化数值189 = 5,
				进化数值190 = 5,
				进化数值199 = 5
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.木相性,
				进化数值89 = 5,
				进化数值90 = 5,
				进化数值99 = 5,
				进化数值100 = 5,
				进化数值109 = 5,
				进化数值110 = 5,
				进化数值119 = 5,
				进化数值120 = 5,
				进化数值129 = 5,
				进化数值130 = 5,
				进化数值139 = 5,
				进化数值140 = 5,
				进化数值149 = 5,
				进化数值150 = 5,
				进化数值159 = 5,
				进化数值160 = 5,
				进化数值169 = 5,
				进化数值170 = 5,
				进化数值179 = 5,
				进化数值180 = 5,
				进化数值189 = 5,
				进化数值190 = 5,
				进化数值199 = 5
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.水相性,
				进化数值89 = 5,
				进化数值90 = 5,
				进化数值99 = 5,
				进化数值100 = 5,
				进化数值109 = 5,
				进化数值110 = 5,
				进化数值119 = 5,
				进化数值120 = 5,
				进化数值129 = 5,
				进化数值130 = 5,
				进化数值139 = 5,
				进化数值140 = 5,
				进化数值149 = 5,
				进化数值150 = 5,
				进化数值159 = 5,
				进化数值160 = 5,
				进化数值169 = 5,
				进化数值170 = 5,
				进化数值179 = 5,
				进化数值180 = 5,
				进化数值189 = 5,
				进化数值190 = 5,
				进化数值199 = 5
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.火相性,
				进化数值89 = 5,
				进化数值90 = 5,
				进化数值99 = 5,
				进化数值100 = 5,
				进化数值109 = 5,
				进化数值110 = 5,
				进化数值119 = 5,
				进化数值120 = 5,
				进化数值129 = 5,
				进化数值130 = 5,
				进化数值139 = 5,
				进化数值140 = 5,
				进化数值149 = 5,
				进化数值150 = 5,
				进化数值159 = 5,
				进化数值160 = 5,
				进化数值169 = 5,
				进化数值170 = 5,
				进化数值179 = 5,
				进化数值180 = 5,
				进化数值189 = 5,
				进化数值190 = 5,
				进化数值199 = 5
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.土相性,
				进化数值89 = 5,
				进化数值90 = 5,
				进化数值99 = 5,
				进化数值100 = 5,
				进化数值109 = 5,
				进化数值110 = 5,
				进化数值119 = 5,
				进化数值120 = 5,
				进化数值129 = 5,
				进化数值130 = 5,
				进化数值139 = 5,
				进化数值140 = 5,
				进化数值149 = 5,
				进化数值150 = 5,
				进化数值159 = 5,
				进化数值160 = 5,
				进化数值169 = 5,
				进化数值170 = 5,
				进化数值179 = 5,
				进化数值180 = 5,
				进化数值189 = 5,
				进化数值190 = 5,
				进化数值199 = 5
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.所有相性,
				进化数值89 = 5,
				进化数值90 = 5,
				进化数值99 = 5,
				进化数值100 = 5,
				进化数值109 = 5,
				进化数值110 = 5,
				进化数值119 = 5,
				进化数值120 = 5,
				进化数值129 = 5,
				进化数值130 = 5,
				进化数值139 = 5,
				进化数值140 = 5,
				进化数值149 = 5,
				进化数值150 = 5,
				进化数值159 = 5,
				进化数值160 = 5,
				进化数值169 = 5,
				进化数值170 = 5,
				进化数值179 = 5,
				进化数值180 = 5,
				进化数值189 = 5,
				进化数值190 = 5,
				进化数值199 = 5
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.所有技能上升,
				进化数值89 = 10,
				进化数值90 = 10,
				进化数值99 = 10,
				进化数值100 = 10,
				进化数值109 = 10,
				进化数值110 = 10,
				进化数值119 = 10,
				进化数值120 = 10,
				进化数值129 = 10,
				进化数值130 = 10,
				进化数值139 = 10,
				进化数值140 = 10,
				进化数值149 = 10,
				进化数值150 = 10,
				进化数值159 = 10,
				进化数值160 = 10,
				进化数值169 = 10,
				进化数值170 = 10,
				进化数值179 = 10,
				进化数值180 = 10,
				进化数值189 = 10,
				进化数值190 = 10,
				进化数值199 = 10
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.金抗性,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.木抗性,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.水抗性,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.火抗性,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.土抗性,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.所有抗性,
				进化数值89 = 20,
				进化数值90 = 20,
				进化数值99 = 20,
				进化数值100 = 20,
				进化数值109 = 20,
				进化数值110 = 20,
				进化数值119 = 20,
				进化数值120 = 20,
				进化数值129 = 20,
				进化数值130 = 20,
				进化数值139 = 20,
				进化数值140 = 20,
				进化数值149 = 20,
				进化数值150 = 20,
				进化数值159 = 20,
				进化数值160 = 20,
				进化数值169 = 20,
				进化数值170 = 20,
				进化数值179 = 20,
				进化数值180 = 20,
				进化数值189 = 20,
				进化数值190 = 20,
				进化数值199 = 20
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗遗忘,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗中毒,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗冰冻,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗昏睡,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗混乱,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗镇魂,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗化功,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗水牢,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗锁灵,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗迷心,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.抗所有异常,
				进化数值89 = 20,
				进化数值90 = 20,
				进化数值99 = 20,
				进化数值100 = 20,
				进化数值109 = 20,
				进化数值110 = 20,
				进化数值119 = 20,
				进化数值120 = 20,
				进化数值129 = 20,
				进化数值130 = 20,
				进化数值139 = 20,
				进化数值140 = 20,
				进化数值149 = 20,
				进化数值150 = 20,
				进化数值159 = 20,
				进化数值160 = 20,
				进化数值169 = 20,
				进化数值170 = 20,
				进化数值179 = 20,
				进化数值180 = 20,
				进化数值189 = 20,
				进化数值190 = 20,
				进化数值199 = 20
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗金,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗木,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗水,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗火,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗土,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视所有抗性,
				进化数值89 = 10,
				进化数值90 = 20,
				进化数值99 = 30,
				进化数值100 = 40,
				进化数值109 = 50,
				进化数值110 = 60,
				进化数值119 = 70,
				进化数值120 = 80,
				进化数值129 = 80,
				进化数值130 = 20,
				进化数值139 = 30,
				进化数值140 = 40,
				进化数值149 = 50,
				进化数值150 = 60,
				进化数值159 = 70,
				进化数值160 = 80,
				进化数值169 = 80,
				进化数值170 = 40,
				进化数值179 = 50,
				进化数值180 = 60,
				进化数值189 = 70,
				进化数值190 = 80,
				进化数值199 = 80
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗遗忘,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗中毒,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗冰冻,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗昏睡,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗混乱,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗镇魂,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗化功,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗水牢,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗锁灵,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视目标抗迷心,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.忽视所有抗异常,
				进化数值89 = 20,
				进化数值90 = 20,
				进化数值99 = 20,
				进化数值100 = 20,
				进化数值109 = 20,
				进化数值110 = 20,
				进化数值119 = 20,
				进化数值120 = 20,
				进化数值129 = 20,
				进化数值130 = 20,
				进化数值139 = 20,
				进化数值140 = 20,
				进化数值149 = 20,
				进化数值150 = 20,
				进化数值159 = 20,
				进化数值160 = 20,
				进化数值169 = 20,
				进化数值170 = 20,
				进化数值179 = 20,
				进化数值180 = 20,
				进化数值189 = 20,
				进化数值190 = 20,
				进化数值199 = 20
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.连击,
				进化数值89 = 10,
				进化数值90 = 10,
				进化数值99 = 10,
				进化数值100 = 10,
				进化数值109 = 10,
				进化数值110 = 10,
				进化数值119 = 10,
				进化数值120 = 10,
				进化数值129 = 10,
				进化数值130 = 10,
				进化数值139 = 10,
				进化数值140 = 10,
				进化数值149 = 10,
				进化数值150 = 10,
				进化数值159 = 10,
				进化数值160 = 10,
				进化数值169 = 10,
				进化数值170 = 10,
				进化数值179 = 10,
				进化数值180 = 10,
				进化数值189 = 10,
				进化数值190 = 10,
				进化数值199 = 10
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.连击率,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.反击,
				进化数值89 = 10,
				进化数值90 = 10,
				进化数值99 = 10,
				进化数值100 = 10,
				进化数值109 = 10,
				进化数值110 = 10,
				进化数值119 = 10,
				进化数值120 = 10,
				进化数值129 = 10,
				进化数值130 = 10,
				进化数值139 = 10,
				进化数值140 = 10,
				进化数值149 = 10,
				进化数值150 = 10,
				进化数值159 = 10,
				进化数值160 = 10,
				进化数值169 = 10,
				进化数值170 = 10,
				进化数值179 = 10,
				进化数值180 = 10,
				进化数值189 = 10,
				进化数值190 = 10,
				进化数值199 = 10
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.反击率,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.反震度,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.反震率,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.物理必杀率,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.法术必杀率,
				进化数值89 = 30,
				进化数值90 = 30,
				进化数值99 = 30,
				进化数值100 = 30,
				进化数值109 = 30,
				进化数值110 = 30,
				进化数值119 = 30,
				进化数值120 = 30,
				进化数值129 = 30,
				进化数值130 = 30,
				进化数值139 = 30,
				进化数值140 = 30,
				进化数值149 = 30,
				进化数值150 = 30,
				进化数值159 = 30,
				进化数值160 = 30,
				进化数值169 = 30,
				进化数值170 = 30,
				进化数值179 = 30,
				进化数值180 = 30,
				进化数值189 = 30,
				进化数值190 = 30,
				进化数值199 = 30
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.准确,
				进化数值89 = 40,
				进化数值90 = 40,
				进化数值99 = 40,
				进化数值100 = 40,
				进化数值109 = 40,
				进化数值110 = 40,
				进化数值119 = 40,
				进化数值120 = 40,
				进化数值129 = 40,
				进化数值130 = 40,
				进化数值139 = 40,
				进化数值140 = 40,
				进化数值149 = 40,
				进化数值150 = 40,
				进化数值159 = 40,
				进化数值160 = 40,
				进化数值169 = 40,
				进化数值170 = 40,
				进化数值179 = 40,
				进化数值180 = 40,
				进化数值189 = 40,
				进化数值190 = 40,
				进化数值199 = 40
			});
			Singleton<全局变量类>.I.超级进化配置.属性列表.Add(new 超级进化列表类
			{
				是否启用 = true,
				属性名字 = AllEnums.属性名字Type.闪避,
				进化数值89 = 110,
				进化数值90 = 120,
				进化数值99 = 130,
				进化数值100 = 130,
				进化数值109 = 140,
				进化数值110 = 140,
				进化数值119 = 150,
				进化数值120 = 160,
				进化数值129 = 170,
				进化数值130 = 170,
				进化数值139 = 180,
				进化数值140 = 180,
				进化数值149 = 190,
				进化数值150 = 190,
				进化数值159 = 200,
				进化数值160 = 200,
				进化数值169 = 220,
				进化数值170 = 240,
				进化数值179 = 260,
				进化数值180 = 280,
				进化数值189 = 300,
				进化数值190 = 320,
				进化数值199 = 340
			});
			File.WriteAllText(mEdebOPadFyb5ykL5Wy.W80P9ipOVU("超级进化配置类.json"), JsonConvert.SerializeObject(Singleton<全局变量类>.I.超级进化配置, Formatting.Indented));
		}
		catch (Exception ex)
		{
			Log.Error("超级进化配置读取失败：" + ex.Message + "(" + ex.StackTrace + ")");
		}
	}

	
	internal void VvFDtgoAPt()
	{
		try
		{
			File.WriteAllText(mEdebOPadFyb5ykL5Wy.W80P9ipOVU("超级进化配置类.json"), JsonConvert.SerializeObject(Singleton<全局变量类>.I.超级进化配置, Formatting.Indented));
			Log.Debug("超级进化配置保存完毕！");
		}
		catch (Exception ex)
		{
			Log.Error("超级进化配置保存失败：" + ex.Message + "(" + ex.StackTrace + ")");
		}
	}

	
	internal string KPRDAP1Op1()
	{
		SueDZGCGlv();
		return JsonConvert.SerializeObject(Singleton<全局变量类>.I.超级进化配置, Formatting.Indented);
	}

	
	public void BvhDzQDRki(string P_0)
	{
		Singleton<全局变量类>.I.超级进化配置 = JsonConvert.DeserializeObject<超级进化配置类>(P_0);
		VvFDtgoAPt();
	}

	
	public bool rsWjuFnPQd(int P_0)
	{
		_003C_003Ec__DisplayClass7_0 CS_0024_003C_003E8__locals2 = new _003C_003Ec__DisplayClass7_0();
		CS_0024_003C_003E8__locals2.l0wMuCvMy3 = P_0;
		return smHjJ5ZG8W.Any( (int x) => x == CS_0024_003C_003E8__locals2.l0wMuCvMy3);
	}

	
	internal void 超级进化事件处理(MyNATSocketClient myclient, string level)
	{
		_003C_003Ec__DisplayClass8_0 CS_0024_003C_003E8__locals39 = new _003C_003Ec__DisplayClass8_0();
		CS_0024_003C_003E8__locals39.MJcMbir44e = myclient;
		try
		{
			if (!WFbjwFZLly())
			{
				return;
			}
			CS_0024_003C_003E8__locals39.DnRMJ4BTiS = CS_0024_003C_003E8__locals39.MJcMbir44e.user.缓存数据.超级进化格子;
			CS_0024_003C_003E8__locals39.MJcMbir44e.user.缓存数据.超级进化格子 = 0;
			if (CS_0024_003C_003E8__locals39.DnRMJ4BTiS < 101 || CS_0024_003C_003E8__locals39.DnRMJ4BTiS > 180 || string.IsNullOrWhiteSpace(level) || !int.TryParse(level, out CS_0024_003C_003E8__locals39.ugPMd43JWm) || !rsWjuFnPQd(CS_0024_003C_003E8__locals39.ugPMd43JWm) || CS_0024_003C_003E8__locals39.MJcMbir44e.user.背包数据.物品列表[CS_0024_003C_003E8__locals39.DnRMJ4BTiS].物品ID <= 0)
			{
				return;
			}
			CS_0024_003C_003E8__locals39.zLBMKy0hKm = false;
			CS_0024_003C_003E8__locals39.sEYMR3xwdk = false;
			CS_0024_003C_003E8__locals39.MJcMbir44e.超级进化事件 =  (int v) =>
			{
				if (v > 0)
				{
					if (v != CS_0024_003C_003E8__locals39.DnRMJ4BTiS)
					{
						return;
					}
					CS_0024_003C_003E8__locals39.zLBMKy0hKm = true;
				}
				else if (v == -1)
				{
					CS_0024_003C_003E8__locals39.sEYMR3xwdk = true;
				}
				if (CS_0024_003C_003E8__locals39.zLBMKy0hKm && CS_0024_003C_003E8__locals39.sEYMR3xwdk)
				{
					CS_0024_003C_003E8__locals39.MJcMbir44e.超级进化事件 = null;
					List<属性数据> list = CS_0024_003C_003E8__locals39.MJcMbir44e.user.背包数据.物品列表[CS_0024_003C_003E8__locals39.DnRMJ4BTiS].装备属性列表.FindAll( (属性数据 x) => x.属性类别 == 514 || x.属性类别 == 770 || x.属性类别 == 3074);
					List<string[]> list2 = new List<string[]>();
					using (List<属性数据>.Enumerator enumerator = list.GetEnumerator())
					{
						while (enumerator.MoveNext())
						{
							_003C_003Ec__DisplayClass8_1 CS_0024_003C_003E8__locals42 = new _003C_003Ec__DisplayClass8_1();
							CS_0024_003C_003E8__locals42.gdFMW2auXM = CS_0024_003C_003E8__locals39;
							CS_0024_003C_003E8__locals42.mHRMUgFHlK = enumerator.Current;
							if (问道数据类.属性名字字典.Contains(CS_0024_003C_003E8__locals42.mHRMUgFHlK.属性标识))
							{
								超级进化列表类 超级进化列表类2 = Singleton<全局变量类>.I.超级进化配置.属性列表.Find( (超级进化列表类 x) => x.是否启用 && x.属性名字 == (AllEnums.属性名字Type)CS_0024_003C_003E8__locals42.mHRMUgFHlK.属性标识 && x.Is可进化(CS_0024_003C_003E8__locals42.gdFMW2auXM.ugPMd43JWm, CS_0024_003C_003E8__locals42.mHRMUgFHlK.属性数值));
								if (超级进化列表类2 != null)
								{
									string[] array = new string[2];
									DefaultInterpolatedStringHandler defaultInterpolatedStringHandler = new DefaultInterpolatedStringHandler(1, 2);
									defaultInterpolatedStringHandler.AppendFormatted((AllEnums.属性类别)CS_0024_003C_003E8__locals42.mHRMUgFHlK.属性类别);
									defaultInterpolatedStringHandler.AppendLiteral("/");
									defaultInterpolatedStringHandler.AppendFormatted((AllEnums.属性标识Type)CS_0024_003C_003E8__locals42.mHRMUgFHlK.属性标识);
									array[0] = defaultInterpolatedStringHandler.ToStringAndClear();
									array[1] = $"{超级进化列表类2.Is取数值(CS_0024_003C_003E8__locals39.ugPMd43JWm)}";
									list2.Add(array);
								}
							}
						}
					}
					if (list2.Count > 0)
					{
						Singleton<WdAPI>.I.NNfIVUuyWv(CS_0024_003C_003E8__locals39.MJcMbir44e, CS_0024_003C_003E8__locals39.DnRMJ4BTiS, list2);
						MyNATSocketClient myNATSocketClient = CS_0024_003C_003E8__locals39.MJcMbir44e;
						WdAPI i = Singleton<WdAPI>.I;
						DefaultInterpolatedStringHandler defaultInterpolatedStringHandler = new DefaultInterpolatedStringHandler(62, 2);
						defaultInterpolatedStringHandler.AppendLiteral("你的#Y");
						defaultInterpolatedStringHandler.AppendFormatted(CS_0024_003C_003E8__locals39.MJcMbir44e.user.背包数据.物品列表[CS_0024_003C_003E8__locals39.DnRMJ4BTiS].名字);
						defaultInterpolatedStringHandler.AppendLiteral("#n在进化到#R");
						defaultInterpolatedStringHandler.AppendFormatted(CS_0024_003C_003E8__locals39.ugPMd43JWm);
						defaultInterpolatedStringHandler.AppendLiteral("#n级时触发了#G超进化#n机制，#B蓝#n、#O粉#n、#Y黄#n属性提升到了当前等级的完美数值。");
						myNATSocketClient.C_Send(i.提示_提醒和杂项公告(defaultInterpolatedStringHandler.ToStringAndClear()));
						if (Singleton<全局变量类>.I.超级进化配置.谣言开关)
						{
							Action<byte[]> client频道事件 = Singleton<全局变量类>.I.Client频道事件;
							if (client频道事件 != null)
							{
								WdAPI i2 = Singleton<WdAPI>.I;
								defaultInterpolatedStringHandler = new DefaultInterpolatedStringHandler(64, 2);
								defaultInterpolatedStringHandler.AppendLiteral("#26天呐，#Y");
								defaultInterpolatedStringHandler.AppendFormatted(CS_0024_003C_003E8__locals39.MJcMbir44e.user.人物数据.昵称);
								defaultInterpolatedStringHandler.AppendLiteral("#n的#Y");
								defaultInterpolatedStringHandler.AppendFormatted(CS_0024_003C_003E8__locals39.MJcMbir44e.user.背包数据.物品列表[CS_0024_003C_003E8__locals39.DnRMJ4BTiS].名字);
								defaultInterpolatedStringHandler.AppendLiteral("#n进化时触发了#G超进化#n机制，#B蓝#n、#O粉#n、#Y黄#n属性提升到了当前等级的完美数值。");
								client频道事件(i2.组包聊天信息(defaultInterpolatedStringHandler.ToStringAndClear(), "管理员"));
							}
						}
						CS_0024_003C_003E8__locals39.MJcMbir44e.S_Send(new byte[23]
						{
							77, 90, 0, 0, 0, 0, 0, 0, 0, 13,
							65, 38, 0, 0, 0, 1, 0, 71, 1, 0,
							0, 0, 0
						}, "超级进化事件处理");
					}
				}
			};
		}
		catch (Exception ex)
		{
			Log.Error("超级进化事件处理-报错：" + ex.Message + "(" + ex.StackTrace + ")");
		}
	}

	
	public QxBx5YDqZUOBMg9A6NN()
	{
	}

	
	static QxBx5YDqZUOBMg9A6NN()
	{
		smHjJ5ZG8W = new int[23]
		{
			89, 90, 99, 100, 109, 110, 119, 120, 129, 130,
			139, 140, 149, 150, 159, 160, 169, 170, 179, 180,
			189, 190, 199
		};
	}
}
